
/* No comment provided by engineer. */
" (%i of %i)" = " (%1$i of %2$i)";

/* No comment provided by engineer. */
" (Autoreply)" = "(Automaattinen vastaus)";

/* No comment provided by engineer. */
" Please restart Adium." = " Please restart Adium.";

/* Description of safe files (files which Adium can open automatically without danger to the user). This description should be on two lines; the lines are separated by \n. */
"\"Safe\" files include movies, pictures,\nsounds, text documents, and archives." = "\"Turvallisia\" tiedostoja ovat videot, kuvat,\näänet, asiakirjat ja arkistot.";

/* file size measured in kilobytes */
"%.1f KB" = "%.1f kB";

/* file size measured in kilobytes out of some other measurement */
"%.1f KB of %@" = "%1$.1f kB / %2$@ ";

/* file sizes both measured in kilobytes */
"%.1f of %.1f KB" = "%1$.1f / %2$.1f kB";

/* file size measured in megabytes */
"%.2f MB" = "%.2f MB";

/* file size measured in megabytes out of some other measurement */
"%.2f MB of %@" = "%1$.2f MB /  %2$@";

/* file sizes both measured in megabytes */
"%.2f of %.2f MB" = "%1$.2f / %2$.2f MB";

/* file size measured in gigabytes */
"%.3f GB" = "%.3f GB";

/* file size measured in gigabytes out of some other measurement */
"%.3f GB of %@" = "%1$.3f GB / %2$@";

/* file sizes both measured in gigabytes */
"%.3f of %.3f GB" = "%1$.3f of / $.3f GB";

/* file sizes both measured in terabytes */
"%.4f of %.4f TB" = "%1$.4f / %2$.4f TB";

/* file size measured in terabytes */
"%.4f TB" = "%.4f TB";

/* file size measured in terabytes out of some other measurement */
"%.4f TB of %@" = "%1$.4f TB /  %2$@";

/* No comment provided by engineer. */
"%@" = "%@";

/* No comment provided by engineer. */
"%@ appears to be offline. How do you want to send this message?" = "%@ vaikuttaa olevan Offline-tilassa. Kuinka haluat yrittää viestin lähettämistä?";

/* Event: <A contact's name> became active (is no longer idle) */
"%@ became active" = "%@ on jälleen aktiivinen";

/* No comment provided by engineer. */
"%@ began receiving %@" = "%1$@ alkoi vastaanottaa tiedostoa %2$@";

/* No comment provided by engineer. */
"%@ began sending you %@" = "%1$@ alkoi lähettää sinulle tiedostoa %2$@";

/* Event: <A contact's name> came back (is now available) */
"%@ came back" = "%@ tuli takaisin";

/* No comment provided by engineer. */
"%@ cancelled the transfer of %@" = "%1$@ peruuttii tiedoston %2$@ siirron";

/* No comment provided by engineer. */
"%@ closed the conversation window." = "%@ sulki keskusteluikkunan.";

/* Event: <A contact's name> connected */
"%@ connected" = "%@ yhdistää.";

/* Event: <A contact's name> disconnected */
"%@ disconnected" = "%@ katkaisee yhteyden.";

/* No comment provided by engineer. */
"%@ had been successfully added to the Address Book.\nWould you like to edit the card now?" = "%@ on onnistuneesti lisätty Osoitekirjaan. Haluatko muokata korttia nyt?";

/* No comment provided by engineer. */
"%@ has sent you (%@) an unknown encryption fingerprint.\n\nFingerprint for you: %@\n\nPurported fingerprint for %@: %@\n\nAccept this fingerprint as verified?" = "%1$@ on lähettänyt sinulle (%2$@) tunnistamattoman salaustunnisteen.\n\nOma salaustunnisteesi: %3$@\n\nHaluttu salaustunniste  %4$@: %5$@\n\nHyväksy tämä salaustunniste luotettavaksi?";

/* AccountName on ChatRoomName */
"%@ in %@" = "%1$@ huoneessa %2$@";

/* No comment provided by engineer. */
"%@ invites you to join the chat \"%@\"" = "%1$@ kutsuu sinut liittymään keskusteluun \"%2$@\"";

/* Event: <A contact's name> is no longer seen (went offline, or you went offline) */
"%@ is no longer seen" = "%@ ei ole enään tavoitettavissa.";

/* Message when the remote contact cancels his half of an encrypted conversation. %s will be a name. */
"%@ is no longer using encryption; you should cancel encryption on your side." = "%@ on lopettanut keskustelun salaamisen, sinun tulisi sulkea salaus myös omalta puoleltasi.";

/* Event: <A contact's name> is seen (which can be 'came online' or 'was online when you connected') */
"%@ is seen" = "%@ on tavoitettavissa.";

/* No comment provided by engineer. */
"%@ is the name of the default status icon pack; this pack therefore can not be installed." = "%@ on varattu vakiotilakuvaakeiden nimeksi. Tätä pakettia ei voida asentaa.";

/* Contact joined Chat Name */
"%@ joined %@" = "%1$@ liittyi keskusteluun %2$@";

/* No comment provided by engineer. */
"%@ joined the chat" = "%@ liittyi keskuteluun";

/* Contact left Chat Name */
"%@ left %@" = "%1$@ poistui keskustelusta %2$@";

/* No comment provided by engineer. */
"%@ left the chat." = "%@ poistui keskustelusta.";

/* No comment provided by engineer. */
"%@ Link" = "%@ Linkki";

/* (a bytes string) received */
"%@ received" = "%@ vastaanotettu";

/* No comment provided by engineer. */
"%@ received %@" = "%1$@ vastaanotettu %2$@";

/* No comment provided by engineer. */
"%@ received new email" = "%@ tunnukseen on saapunut uusi sähköpostiviesti";

/* Time remaining for a file transfer to be completed phrase. %@ will be replaced by an amount of time such as '5 seconds' or '4 minutes and 30 seconds'. */
"%@ remaining" = "%@ jäljellä";

/* Event: <A contact's name> requested authorization */
"%@ requested authorization" = "%@ pyytää lupaa saada nähdä sinut";

/* No comment provided by engineer. */
"%@ requests to send you %@" = "%1$@ haluaa lähettää sinulle tiedoston %2$@";

/* Contact said Message */
"%@ said %@" = "%1$@ sanoi %2$@";

/* (a bytes string) sent */
"%@ sent" = "%@ lähetetty";

/* No comment provided by engineer. */
"%@ sent you %@" = "%1$@ lähetti sinulle tiedoston %2$@";

/* Contact sent you a message */
"%@ sent you a message" = "%@ lähetti sinulle viestin";

/* No comment provided by engineer. */
"%@ speaks:" = "%@ sanoo:";

/* AccountName talking to Username */
"%@ talking to %@" = "%1$@ puhuu henkilölle %2$@";

/* Event: <A contact's name> went away (is no longer available but is still online) */
"%@ went away" = "%@ vaihtaa tilakseen \"Poissa\"";

/* Event: <A contact's name> went idle */
"%@ went idle" = "%@ vaihtaa tilakseen \"Ei aktiivinen\"";

/* No comment provided by engineer. */
"%@'s Image" = "Ystävän %@ kuva";

/* No comment provided by engineer. */
"%@'s Info" = "Ystävän %@ tiedot";

/* Statement that someone's private (encrypted) connection is closed. */
"%@'s private connection to you is closed." = "Ystävän %@ salattu yhtyes suljettu";

/* First placeholder is a name; second is a filename */
"%@'s transfer of %@ failed" = "Tiedoston %2$@ siirtäminen ystävältä %1$@ epäonnistui";

/* Rate of transfer phrase. %@ will be replaced by an abbreviated data amount such as 4 KB or 1 MB */
"%@/sec" = "%@/s";

/* Trigger for the album of the currently playing iTunes song */
"%_album" = "%_albumi";

/* Trigger for the artist of the currently playing iTunes song */
"%_artist" = "%_artisti";

/* Trigger for the composer of the currently playing iTunes song */
"%_composer" = "%_säveltäjä";

/* Trigger for the genre of the currently playing iTunes song */
"%_genre" = "%_laji";

/* Trigger for an iTunes Music Store link to the currently playing iTunes song */
"%_iTMS" = "%_iTMS";

/* Trigger for the song - artist of the currently playing iTunes song */
"%_iTunes" = "%_iTunes";

/* Command which triggers *is listening to %_track by %_artist* */
"%_music" = "%_musiikki";

/* Trigger for the genre of the currently playing iTunes song */
"%_status" = "%_tila";

/* Trigger for the name of the currently playing iTunes song */
"%_track" = "%_kuuntelen";

/* Overview of total, enabled, and online accounts */
"%i accounts, %i enabled, %i online" = "%1$i tunnusta, %2$i käytössä, %3$i offline-tilassa";

/* Overview of total and online accounts */
"%i accounts, %i online" = "%1$i tunnusta joista %2$i online tilassa";

/* No comment provided by engineer. */
"%i Contacts" = "%i ystävää";

/* (number) downloads */
"%i downloads" = "%i latausta";

/* No comment provided by engineer. */
"%i logs" = "%i viestihistoriaa";

/* No comment provided by engineer. */
"%i matching logs" = "%i hakua vastaavaa viestihistoriaa";

/* (number) uploads */
"%i uploads" = "%i lähetystä";

/* file size measured in bytes */
"%lu bytes" = "%lu bittiä";

/* file size measured in bytes out of some other measurement */
"%lu bytes of %@" = "%1$lu bittiä /  %2$@";

/* file sizes both measured in bytes */
"%lu of %lu bytes" = "%1$lu /  %2$lu bytes";

/* Copy, in parenthesis, as a noun indicating that the preceding item is a duplicate */
"(Copy)" = "(Kopio)";

/* No comment provided by engineer. */
"(Idle) Status" = "(Ei aktiivinen) Tila";

/* No comment provided by engineer. */
"(Multiple privacy levels are active)" = "(Useita yksityisyystasoja käytössä)";

/* No comment provided by engineer. */
"(Unavailable)" = "(Ei saatavilla)";

/* Phrase sent in response to %_music.  The first %%@ is the track; the second %%@ is the artist. */
"*is listening to %@ by %@*" = "%1$@ - %2$@";

/* Phrase sent in response to %_music when nothing is playing. */
"*is listening to nothing*" = "iTunes ei ole käytössä";

/* Checkbox under 'on screen edges' in the advanced contact list preferences */
"...only while Adium is in the background" = "...ainoastaan kun Adium ei ole aktiivinen.";

/* No comment provided by engineer. */
"1 Contact" = "ystävä";

/* No comment provided by engineer. */
"1 download" = "lataus";

/* No comment provided by engineer. */
"1 log" = "viestihistoria";

/* No comment provided by engineer. */
"1 matching log" = "vastaava viestihistoria";

/* No comment provided by engineer. */
"1 upload" = "siirto";

/* Colon which will be appended after a label such as 'User Name', before an input field */
":" = ":";

/* No comment provided by engineer. */
"<HTML>Adium has detected that you have previously used Fire.  You may choose to import settings from Fire by pressing continue below.  If you choose to not use these settings, simply skip this step.<HTML>" = "<HTML>Adium on havainnut, että olet aikaisemmin käyttänyt Fireä. Voit nyt halutessasi tuoda astuksesi Firestä valitsemalla jatka. Et halua tuoda Firen asetuksia, ohita tämä vaihe.<HTML>";

/* No comment provided by engineer. */
"<HTML>Adium is <i>your</i> instant messaging solution.<br><br>Chat with whomever you want, whenever you want, however you want.  Multiple messaging services or accounts? Just one account? Work? Play? Both? No problem; Adium has you covered.<br><br>Adium is fast, free, and fun, with an interface you'll love to use day in and day out. :)<br><br>This assistant will help you set up your instant messaging accounts and get started chatting.<br><br>Click <b>Continue</b> and the duck will take it from here.</HTML>" = "<HTML>Adium on pikaviestintäohjelma <i>sinulle</i>.<br><br>Juttele kenelle tahansa, miten tahansa ja milloin tahansa. Onko sinulle monta pikavistitunnnusta? Vain yksi tunnus? Tunnus töissä? Kotona? Molemmissa? Ei ongelmaa, Adium pystyy kaikkeen mihin sinäkin.<br><br>Adium on nopea, ilmainen ja käyttäjäystävällinen, sitä on mukava käyttää päivästä toiseen.<br><br>Tämä apuri avustaa sinut alkuun ohjelman kanssa, jotta pääset aloittamaan keskustelun mahdollisimman nopeasti ja vaivattomasti.<br><br>Paina <b>Jatka</b> ja Adium ottaa ohjat käsiinsä.</HTML>";

/* No comment provided by engineer. */
"<HTML>To chat with your friends, family, and coworkers, you must have an instant messaging account on the same service they do. Choose a service, name, and password below; if you don't have an account yet, click <A HREF=\"http://trac.adiumx.com/wiki/CreatingAnAccount#Sigingupforanaccount\">here</A> for more information.\n\nAdium supports as many accounts as you want to add; you can always add more in the Accounts pane of the Adium Preferences.</HTML>" = "<HTML>Keskustellaksesi ystäviesi, perheesi ja työtovereidesi kanssa, sinulla täytyy olla pikaviestitunnus samassa palvelussa kun heilläkin. Valitse alapuolelta pikaviestipalvelu; Syötä käyttäjänimesi ja salasanasi. Jos sinulla ei vielä ole pikaviestitunnusta <A HREF=\"http://trac.adiumx.com/wiki/CreateAnAccount#Sigingupforanaccount\">paina tästä</A> saadaksesi lisää ohjeita.\n\nAdium tukee niin monen tunnuksen yhtäaikaista käyttöä, voit myöhemmin lisätä muut tunnuksesi Asetuksien Tunnukset-panelista.";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* Placeholder shown when no information is available */
"<None>" = "<Ei mitään>";

/* Translation Error */
"A blank translation was returned" = "Tyhjä käännös palautui";

/* No comment provided by engineer. */
"a contact" = "ystävä";

/* No comment provided by engineer. */
"A fingerprint is a unique identifier that you should use to verify the identity of %@.\n\nTo verify the fingerprint, contact %@ via some other authenticated channel such as the telephone or GPG-signed email. Each of you should tell your fingerprint to the other." = "Sormenjälki on uniikki tunniste, jota sinun tulisi käyttää varmistaaksesi identiteettisi of %1$@.\n\nVarmistaaksei sormenjälken, ota yhteyttää %2$@ muun suojatun kanavan kautta, kuten puhelimen tai varmistetun sähköpostin. Teidän tulisi kertoa sormenjälkenne toisillenne.";

/* No comment provided by engineer. */
"a member of %@" = "ryhmän %@ jäsen";

/* No comment provided by engineer. */
"A message may not have been sent; a timeout occurred." = "Viestin lähetyksessä tapahtui virhe, sitä ei välttämättä toimitettu perille.";

/* No comment provided by engineer. */
"About Adium" = "Tietoja: Adium";

/* No comment provided by engineer. */
"About Encryption" = "Tietoja: Salaus";

/* No comment provided by engineer. */
"Above other windows" = "Muiden ikkunoiden päällä";

/* No comment provided by engineer. */
"Accept" = "Hyväksy";

/* No comment provided by engineer. */
"Accepted file transfer" = "Hyväksy tiedoston siirto";

/* Proxy password prompt window title */
"Accessing Proxy" = "Yhdistetään välityspalvelimeen";

/* Title of column containing blocking accounts */
"Account" = "Tunnus";

/* No comment provided by engineer. */
"Account:" = "Tunnus:";

/* Accounts preferences label */
"Accounts" = "Tunnukset";

/* Add button for Privacy Settings */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Add a new contact" = "Lisää uusi ystävä";

/* No comment provided by engineer. */
"Add a new group" = "Lisää uusi ryhmä";

/* No comment provided by engineer. */
"Add an account for:" = "Tunnuksen tyyppi";

/* No comment provided by engineer. */
"Add an Instant Messaging Account" = "Lisää pikaviestitunnus";

/* button title for adding another account in the setup wizard */
"Add Another" = "Lisää toinen";

/* No comment provided by engineer. */
"Add Contact" = "Lisää ystävä";

/* No comment provided by engineer. */
"Add Contact To Group" = "Lisää ystävä ryhmään";

/* No comment provided by engineer. */
"Add Group" = "Lisää ryhmä";

/* No comment provided by engineer. */
"Add Link" = "Lisää linkki";

/* No comment provided by engineer. */
"Add New Layout" = "Lisää asettelu";

/* No comment provided by engineer. */
"Add New Preset" = "Lisää uusi esiasetus";

/* No comment provided by engineer. */
"Add New Theme" = "Lisää uusi teema";

/* Add To Address Book Contextual Menu */
"Add To Address Book" = "Lisää osoitekirjaan";

/* Checkbox in the Authorizatoin Request window to add the contact to the contact list if authorization is granted */
"Add to my Contact List" = "Lisää ystäväluettelo";

/* No comment provided by engineer. */
"Add/Edit Hyperlink" = "Lisää/Muokkaa linkkiä";

/* No comment provided by engineer. */
"Address Book" = "Osoitekirja";

/* No comment provided by engineer. */
"Address Book Information (optional):" = "Tiedot Osoitekirjasta (vaihtoehtoisia):";

/* Error message window title */
"Adium : Error" = "Adium : Virhe";

/* Debug window title */
"Adium Debug Log" = "Adiumin virheenkorjausikkuna";

/* No comment provided by engineer. */
"Adium Forums" = "Adiumin Foorumit (Vain englanniksi)";

/* No comment provided by engineer. */
"Adium Help" = "Adium-ohjeet";

/* No comment provided by engineer. */
"Adium Homepage" = "Adiumin kotisivu";

/* No comment provided by engineer. */
"Adium Icon" = "Adiumin kuvake";

/* No comment provided by engineer. */
"Adium is not your default Instant Messaging client. The default client is loaded when you click messaging URLs in web pages. Would you like Adium to become the default?" = "Adium ei ole asetettu vakiopikaviestintäohjelmaksesi. Vakiopikaviestiohjelmaa käytetään esimerkiksi internet-sivuilla olevien pikaviestilinkkejen avaamiseen. Haluatko tehdä Adiumista vakio-ohjelman.";

/* No comment provided by engineer. */
"Adium is now ready for you. \n\nThe Status indicator at the top of your Contact List and in the Status menu lets you determine whether others see you as Available or Away or, alternately, if you are Offline. Select Custom to type your own status message.\n\nDouble-click a name in your Contact List to begin a conversation.  You can add contacts to your Contact List via the Contact menu.\n\nWant to customize your Adium experience? Check out the Adium Preferences and Xtras Manager via the Adium menu.\n\nEnjoy! Click Done to begin using Adium." = "Adium on valmiina käyttöön.\n\nTilanvalitsin, joka löytyy ystävälistan huipulta, auttaa sinua kertomaan ystävillesi oletko esimerkiksi kiireinen tai tavoitettavissa. Sen kautta voit myös käyttää mukautettuja poissaoloviestejä kertoaksesi heille mitä ikinä keksitkin.\n\nKaksoisosoita nimeä ystävälistassasi aloittaaksesi keskustelun hänen kanssaan. Voit lisätä uusia ystäviä Ystävät-valikon kautta.\n\nHaluatko tehdä Adiumista itsesi näköisen? Tarkista asetukset ja ekstrat Adium-valikosta. ";

/* No comment provided by engineer. */
"Adium plugin" = "Adiumin plugin";

/* No comment provided by engineer. */
"Adium Setup Assistant" = "Adiumin käyttöönottoapuri";

/* Growl installation explanation */
"Adium uses the Growl notification system to provide a configurable interface to display status changes, incoming messages and more.\n\nIt is strongly recommended that you allow Adium to automatically install Growl; no download is required." = "Adium käyttää Growl-huomautusjärjestelmää tarjotaakseen mukautettavan käyttöliittämän tilanmuutosten ja saapuviden viestejen näyttämiseen.\n\nOn suositeltavaa, että annan Adiumin asentaa Growlin, sinun ei itse tarvitse tehdä mitään.";

/* Growl update explanation */
"Adium uses the Growl notification system to provide a configurable interface to display status changes, incoming messages and more.\n\nThis release of Adium includes an updated version of Growl. It is strongly recommended that you allow Adium to automatically update Growl; no download is required." = "Adium käyttää Growl-huomautusjärjestelmää tarjotaakseen mukautettavan käyttöliittämän tilanmuutosten ja saapuviden viestejen näyttämiseen.\n\nTämä Adiumin versio sisältää päivitetyn version Growlista. On suositeltavaa että annat Adiumin päivittää Growlisi.";

/* No comment provided by engineer. */
"Adium was unable to write the log file for this conversation. Please ensure you have appropriate file permissions to write to your log directory (%@) for and then re-enable logging in the General preferences." = "Adium ei voinut luoda viestihistoriaa tälle keskustelulle. Varmista että historiakansiosi (%@) oikeudet ovat asetettu oikeina ja palauta keskusteluiden tallentaminen käyttöön yleisistä asetuksista.";

/* No comment provided by engineer. */
"Advanced" = "Lisäasetukset";

/* No comment provided by engineer. */
"After" = "Jälkeen";

/* Insert Current iTunes track album toolbar menu item. */
"Album" = "Albumi";

/* No comment provided by engineer. */
"Alias" = "Viestinimi";

/* No comment provided by engineer. */
"Alias (User Name)" = "Viestinimi (Käyttäjänimi)";

/* Label beside the field for a contact's alias in the settings tab of the Get Infow indow */
"Alias:" = "Alias:";

/* No comment provided by engineer. */
"All" = "Kaikki";

/* No comment provided by engineer. */
"All (%@)" = "Kaikki (%@)";

/* No comment provided by engineer. */
"All Other Accounts" = "Kaikki muut tunnukset";

/* No comment provided by engineer. */
"Allow anyone" = "Salli kenen tahansa";

/* No comment provided by engineer. */
"Allow only certain contacts" = "Salli ainoastaa tiettyjen osoitteiden";

/* No comment provided by engineer. */
"Allow only contacts on my contact list" = "Salli ainoastaan ystävieni";

/* No comment provided by engineer. */
"An encrypted message from %@ could not be decrypted." = "Salattua viestiä henkilöltä %@ ei pystytty purkamaan.";

/* No comment provided by engineer. */
"An error had occurred while adding %@ to the Address Book." = "Virhe lisättäessä osoitetta %@ Osoitekirjaan.";

/* No comment provided by engineer. */
"An error occurred" = "Tapahtui virhe";

/* No comment provided by engineer. */
"An error occurred while downloading this Xtra: %@." = "Virhe ladattaessa Ekstraa %@.";

/* No comment provided by engineer. */
"An error occurred while installing the X(tra)." = "Virhe asennettaessa Ekstraa.";

/* No comment provided by engineer. */
"Any Date" = "Mikä tahansa päivä";

/* Appearance preferences label */
"Appearance" = "Ulkoasu";

/* No comment provided by engineer. */
"AppleScript set" = "AppleScript paketti";

/* No comment provided by engineer. */
"Applescript:" = "Applescript:";

/* No comment provided by engineer. */
"Are you sure you want to block %@?" = "Oletko varma, että haluat torjua henkilön %@?";

/* No comment provided by engineer. */
"Are you sure you want to delete the %@ Dock Icon? It will be moved to the Trash." = "Oletko varma, että haluat poistaa %@ Dock-kuvakkeen? Se tullaan siirtämään roskakoriin.";

/* No comment provided by engineer. */
"Are you sure you want to delete the %@ Emoticon Pack? It will be moved to the Trash." = "Oletko varma, että haluat poistaa hymiöpaketin %@? Se tullaan siirtämään roskakoriin.";

/* No comment provided by engineer. */
"Are you sure you want to delete the group \"%@\" containing %i saved status items?" = "Oletko varma, että haluat poistaa ryhmän \"%1@\", joka sisältää %2$i tallennettua tilaa?";

/* No comment provided by engineer. */
"Are you sure you want to delete the group \"%@\" containing 1 saved status item?" = "Oletko varma, että haluat poistaa ryhmän \"%@\", jossa on 1 tallennettu tila?";

/* No comment provided by engineer. */
"Are you sure you want to send %i logs to the Trash?" = "Oletko varma, että haluat poistaa %i viestihistoriaa?";

/* No comment provided by engineer. */
"Are you sure you want to unblock %@?" = "Oletko varma, että haluat sallia henkilön %@?";

/* Directional arrow keys word */
"Arrows (%@ and %@)" = "Nuolet (%1$@ ja %2$@)";

/* Insert Current iTunes track artist toolbar menu item. */
"Artist" = "Artisti";

/* No comment provided by engineer. */
"Audio Notifications" = "Äänihuomautukset";

/* No comment provided by engineer. */
"Authorization Requested" = "Kirjautuminen vaaditaan";

/* No comment provided by engineer. */
"Authorize" = "Kirjaudu";

/* FT Preferences */
"Automatically accept files..." = "Hyväksy siirrot automaattisesti...";

/* No comment provided by engineer. */
"Automatically hide the contact list:" = "Piilota ystäväluettelo automaattisesti:";

/* No comment provided by engineer. */
"Available" = "Online-tilassa";

/* No comment provided by engineer. */
"Available for friends only" = "Online-tilassa ainoastaan ystäville";

/* No comment provided by engineer. */
"Away" = "Poissa";

/* No comment provided by engineer. */
"Away and Idle" = "Poissa ja ei aktiivinen";

/* No comment provided by engineer. */
"Away for friends only" = "Poissa ainoastaan ystäville";

/* No comment provided by engineer. */
"Away Message" = "Poissaoloviesti";

/* No comment provided by engineer. */
"Away Message: %@" = "Poissaoloviesti: %@";

/* No comment provided by engineer. */
"Away Status Window" = "Poissaolon ikkuna";

/* No comment provided by engineer. */
"Background images are only applicable to normal and borderless window styles" = "Taustakuvia voi käyttää ainoastaan normaalissa ja reunattomissa ikkunatyyleissä";

/* Translation Error */
"Bad Parameters Sent to Translation" = "Käännös vastaanotti virheellisen arvon";

/* No comment provided by engineer. */
"Badge (Lower Left)" = "Merkki (Vasen alakulma)";

/* No comment provided by engineer. */
"Badge (Lower Right)" = "Merkki (Oikea alakulma)";

/* No comment provided by engineer. */
"Be Right Back" = "Palaan Hetken Kuluttua";

/* No comment provided by engineer. */
"Be right back" = "Palaan hetken kuluttua";

/* Event: became active (follows a contact's name displayed as a header) */
"became active" = "tuli aktiivisesksi";

/* No comment provided by engineer. */
"Becomes idle" = "Tulee ei aktiiviseksi";

/* No comment provided by engineer. */
"Before" = "Ennen";

/* No comment provided by engineer. */
"began receiving %@" = "aloitti tiedoston %@ vastaanottamisen";

/* No comment provided by engineer. */
"Began receiving %@" = "Aloitti tiedoston %@ vastaanottamisen";

/* No comment provided by engineer. */
"Began sending %@" = "Alkoi lähettää tiedostoa %@";

/* No comment provided by engineer. */
"began sending you %@" = "alkoi lähettää sinulle tiedostoa %@";

/* Dock behavior contact alert label */
"Behavior" = "Käyttäytyminen";

/* No comment provided by engineer. */
"Below Name" = "Nimen alapuolella";

/* No comment provided by engineer. */
"Below other windows" = "Muiden ikkunoiden alapuolella";

/* No comment provided by engineer. */
"Beside Name" = "Nimen vieressä";

/* Block Contact menu item */
"Block" = "Torju";

/* No comment provided by engineer. */
"Block certain contacts" = "Torju tietyt ystävät";

/* No comment provided by engineer. */
"Blocking prevents a contact from contacting you or seeing your online status." = "Torjuminen estää ystävää ottamasta sinuun yhteyttä tai näkemästä tilaasi.";

/* No comment provided by engineer. */
"Bold" = "Lihavoi";

/* No comment provided by engineer. */
"Borderless Window" = "Reunaton ikkuna";

/* No comment provided by engineer. */
"Bounce the dock icon" = "Hypäytä dock-kuvaketta";

/* %@ will be repalced with a string like 'one time' or 'repeatedly'. */
"Bounce the dock icon %@" = "Hypäytä dock-kuvaketta %@";

/* Word for [ and ] keys */
"Brackets (%@ and %@)" = "Hakasulut (%1$@ ja %2$@)";

/* No comment provided by engineer. */
"Bring Adium to Front" = "Tuo Adium eteen";

/* No comment provided by engineer. */
"Bring All to Front" = "Tuo kaikki eteen";

/* iTunes toolbar menu item title to make iTunes frontmost app. */
"Bring iTunes to Front" = "Tuo iTunes eteen";

/* No comment provided by engineer. */
"Browse" = "Selaa";

/* No comment provided by engineer. */
"Busy" = "Varattu";

/* Event: came back (follows a contact's name displayed as a header) */
"came back" = "tuli takaisin";

/* Cancel button for Privacy Settings */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancel Encrypted Chat" = "Peruuta salattu keskustelu";

/* File transfer cancelled locally status description */
"Cancelled" = "Peruutettu";

/* No comment provided by engineer. */
"cancelled the transfer of %@" = "peruuttii tiedoston %@ siirron";

/* Translation Error */
"Cannot connect to the translation server" = "Käännöspalveluun ei saada yhteyttä";

/* Translation Error */
"Cannot send data to translation server" = "Käännöspalveluun ei voida lähettää dataa";

/* No comment provided by engineer. */
"Center" = "Keskitä";

/* No comment provided by engineer. */
"Change default messaging client?" = "Vaihda vaikiopikaviestiohjelmaa?";

/* No comment provided by engineer. */
"Change Display Name" = "Vaihda viestinimeä";

/* No comment provided by engineer. */
"Change Icon For:" = "Vaihda kuvake:";

/* No comment provided by engineer. */
"Change Source or Destination" = "Vaihda lähdettä tai kohdetta";

/* No comment provided by engineer. */
"Changed status to %@" = "Vaihtoi tilakseen %@";

/* No comment provided by engineer. */
"Changed status to %@: %@" = "Vaihtoi tilakseen %1$@: %2$@";

/* No comment provided by engineer. */
"Chat" = "Keskustelu";

/* No comment provided by engineer. */
"Chat Transcripts Viewer" = "Viestihistoria";

/* Title for the messages window menu item */
"Chats" = "Keskustelua";

/* Instructions for enabling an account */
"Check a box to enable an account" = "Täytä valinta ottaaksesi tilin käyttöön";

/* No comment provided by engineer. */
"Check For Updates" = "Tarkista päivitykset";

/* No comment provided by engineer. */
"Check Spelling" = "Tarkista oikeinkirjoitus";

/* No comment provided by engineer. */
"Check Spelling As You Type" = "Tarkista oikeinkirjoitus kirjoitettaessa";

/* No comment provided by engineer. */
"Choose Icon" = "Valitse kuvake";

/* No comment provided by engineer. */
"Clear" = "Pyyhi";

/* FT Preferences */
"Clear completed transfers automatically" = "Pyyhi valmistuneet tiedostojen siirrot automaattisesti";

/* No comment provided by engineer. */
"Clear Recent Pictures" = "Pyyhi äsköiset kuvat";

/* Instructions on how to add an account when none are present */
"Click the + to add a new account" = "Paina + lisätäksesi uuden tilin";

/* No comment provided by engineer. */
"Client" = "Asiakas";

/* Title for the close menu item */
"Close" = "Sulje";

/* Title for the close all chats menu item */
"Close All Chats" = "Sulje kaikki keskustelut";

/* Title for the close chat menu item */
"Close Chat" = "Sulje keskustelu";

/* Button title for accepting the action of combining multiple contacts into a metacontact */
"Combine" = "Yhdistä";

/* Title of the prompt when combining two contacts. Each %@ will be filled with a contact name. */
"Combine %@ and %@?" = "Yhdistä %1$@ ja %2$@?";

/* No comment provided by engineer. */
"Combine contacts listed on a single card" = "Yhdistä saman ihmisen kaikki pikavistitunnukset yhteen Osoitekirjan korttiin";

/* Title of the prompt when combining two or more contacts with another.  %@ will be filled with a contact name. */
"Combine these contacts with %@?" = "Yhdistä nämä tiedot tietoon %@?";

/* No comment provided by engineer. */
"Command failed." = "Komento epäonnistui.";

/* No comment provided by engineer. */
"Complete" = "Valmis";

/* Insert Current iTunes track composer toolbar menu item. */
"Composer" = "Säveltäjä";

/* No comment provided by engineer. */
"Configure Alphabetical Sort" = "Mukautu aakkosellista lajittelua";

/* Configure Sort window title */
"Configure Sorting" = "Mukautu lajittelua";

/* No comment provided by engineer. */
"Configure Status Sort" = "Mukauta tilan mukaan lajittelua";

/* No comment provided by engineer. */
"Confirm Quit" = "Vahvista lopettaminen";

/* Header line in the last pane of the Adium setup wizard */
"Congratulations!" = "Onnittelut!";

/* No comment provided by engineer. */
"Connect" = "Yhdistä";

/* No comment provided by engineer. */
"Connect a Guest Account" = "Kirjaudu sisään vieraana";

/* No comment provided by engineer. */
"Connect Guest Account" = "Yhdistä vieraana";

/* Account preferences checkbox for automatically conencting the account when Adium opens */
"Connect when Adium opens" = "Yhdistä kun Adium avataan";

/* Event: connected (follows a contact's name displayed as a header) */
"connected" = "kirjautui sisään";

/* No comment provided by engineer. */
"Connecting" = "Kirjaudutaan";

/* Password prompt window title */
"Connecting Account" = "Kirjaudutaan sisään";

/* No comment provided by engineer. */
"Consolidate Chats" = "Kaikki keskustelut yhteen ikkunaan";

/* Title of column containing user IDs of blocked contacts */
"Contact" = "Ystävät";

/* No comment provided by engineer. */
"Contact Alert" = "Ystäväilmoitus";

/* No comment provided by engineer. */
"Contact Alert Error" = "Ystäväilmoituksen virhe";

/* No comment provided by engineer. */
"Contact becomes idle" = "Ystävä tulee ei aktiiviseksi";

/* No comment provided by engineer. */
"Contact Bubbles" = "Ystäväkuplat";

/* No comment provided by engineer. */
"Contact Bubbles (To Fit)" = "Ystäväkuplat (Sovitetut)";

/* No comment provided by engineer. */
"Contact goes away" = "Ystävä poistuu";

/* Contact icon label in create new AB person */
"Contact Icon" = "Ystävän kuva";

/* No comment provided by engineer. */
"Contact ID" = "Ystävän tunnus";

/* No comment provided by engineer. */
"Contact Info" = "Ystävän tiedot";

/* No comment provided by engineer. */
"Contact is no longer seen" = "Ystävä ei ole enään tavoitettavissa";

/* No comment provided by engineer. */
"Contact is seen" = "Ystävä on tavoitettavissa";

/* No comment provided by engineer. */
"Contact joins a group chat" = "Ystävä liittyy ryhmäkeskusteluun";

/* No comment provided by engineer. */
"Contact leaves a group chat" = "Ystävä poistuu ryhmäkeskustelusta";

/* Name of the window which lists contacts */
"Contact List" = "Ystäväluettelo";

/* No comment provided by engineer. */
"contact list layout" = "ystäväluettelon asettelu";

/* No comment provided by engineer. */
"contact list theme" = "ystäväluettelon teema";

/* AdiumXtras category name */
"Contact List Themes" = "Ystäväluettelon teemat";

/* No comment provided by engineer. */
"Contact Name Format" = "Ystävien nimen muoto";

/* No comment provided by engineer. */
"Contact requests authorization" = "Osoite pyytää sallimista";

/* No comment provided by engineer. */
"Contact returns from away" = "Ystävä palaa takaisin";

/* No comment provided by engineer. */
"Contact returns from idle" = "Ystävä on jälleen aktiivinen";

/* No comment provided by engineer. */
"Contact signs off" = "Ystävä kirjautuu ulos";

/* No comment provided by engineer. */
"Contact signs on" = "Ystävä kirjautuu sisään";

/* Contact type service dropdown label in Add Contact */
"Contact Type:" = "Tunnuksen tyyppi:";

/* No comment provided by engineer. */
"Contact:" = "Ystävä:";

/* Contact List window title */
"Contacts" = "Yhteystietojen käsittely";

/* No comment provided by engineer. */
"Contacts Drawer" = "Ystäväpaneli";

/* No comment provided by engineer. */
"Content" = "Sisältö";

/* 'done' button title */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Contributing to Adium" = "Kehitykseen osallistuminen";

/* No comment provided by engineer. */
"Copy" = "Kopio";

/* No comment provided by engineer. */
"Copy Style" = "Kopio tyyli";

/* Translation Error */
"Could not bind a port to use" = "Porttia ei voitu ottaa käyttöön";

/* No comment provided by engineer. */
"Could not create the %@ folder." = "Kansion %@ luominen epäonnistui";

/* Translation Error */
"Could not open socket to translation server" = "Käännöspalvelun kanavaan ei voitu yhdistää";

/* No comment provided by engineer. */
"Could not receive the last message because it was invalid." = "Viimeistä viestiä ei voitu vastaanottaa, koska se oli viallinen.";

/* No comment provided by engineer. */
"Could not receive the last message because it was too large." = "Viimeistä viestiä ei voitu vastaanottaa, koska se oli liian suuri.";

/* No comment provided by engineer. */
"Could not receive the last message because the rate limit has been exceeded. Please wait a moment and then try again." = "Viimeistä viestiä ei voida vastaanottaa, koska kaistarajoitus ylittyi.\nOle hyvä ja yritä hetken päästä uudelleen.";

/* No comment provided by engineer. */
"Could not receive: you are too evil." = "Ei voitu vastaanottaa, olet liian ilkeä.";

/* No comment provided by engineer. */
"Could not receive; %@ is too evil." = "Ei voitu vastaanottaa, %@ on liian ilkeä.";

/* No comment provided by engineer. */
"Could not send because %@ is blocked." = "%@ on torjuttu, joten viestiä ei voitu lähettää.";

/* No comment provided by engineer. */
"Could not send because %@ is not available." = "%@ ei ole tavoitettavissa, joten viestiä ei voitu lähettää.";

/* No comment provided by engineer. */
"Could not send from %@ to %@" = "Ei voitu lähettää kohteesta %1$@ kohteeseen %2$@";

/* No comment provided by engineer. */
"Could not send the last message because it was too large." = "Viestin koko oli liian suuri, joten sitä ei voitu lähettää.";

/* No comment provided by engineer. */
"Could not send the last message because the rate limit has been exceeded. Please wait a moment and then try again." = "Viimeistä viestiä ei voida vastaanottaa, koska kaistarajoitus ylittyi.\nOle hyvä ja yritä hetken päästä uudelleen.";

/* No comment provided by engineer. */
"Could not send; a connection error occurred." = "Tapahtui yhteysvirhe, viestiäsi ei ole lähetetty.";

/* No comment provided by engineer. */
"Could not send; not allowed while invisible." = "Näyt muille Offline-tilassa, viestiäsi ei voida lähettää.";

/* No comment provided by engineer. */
"Create New Person" = "Luo uusi ystävä";

/* Word for { and } keys */
"Curly braces (%@ and %@)" = "Kaarisulut (%1$@ ja %2$@)";

/* No comment provided by engineer. */
"Current Status" = "Nykyinen tila";

/* No comment provided by engineer. */
"Custom" = "Mukautettu";

/* No comment provided by engineer. */
"Custom settings for each account" = "Mukautetut asetukset kullekkin tilille";

/* No comment provided by engineer. */
"Customize Toolbar" = "Mukauta työkalupalkkia";

/* No comment provided by engineer. */
"Cut" = "Leikkaa";

/* No comment provided by engineer. */
"Date" = "Päiväys";

/* singular day */
"day" = "päivä";

/* plural days */
"days" = "päivää";

/* No comment provided by engineer. */
"Days" = "Päivää";

/* No comment provided by engineer. */
"Debug Window" = "Virheenkorjausikkuna";

/* No comment provided by engineer. */
"Default" = "Vakio";

/* No comment provided by engineer. */
"Default Notifications" = "Vakio";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete %i Xtras?" = "Poista %i ekstraa?";

/* No comment provided by engineer. */
"Delete Account" = "Poista tili";

/* No comment provided by engineer. */
"Delete All" = "Poista kaikki";

/* No comment provided by engineer. */
"Delete all logs" = "Poista kaikki viestihistoriat";

/* No comment provided by engineer. */
"Delete Dock Icon" = "Poista dock-kuvake";

/* No comment provided by engineer. */
"Delete Emoticon Pack" = "Poista hymiöpaketti";

/* No comment provided by engineer. */
"Delete Layout" = "Poista asettelu";

/* No comment provided by engineer. */
"Delete Logs?" = "Poista viestihistoriat";

/* No comment provided by engineer. */
"Delete selected log" = "Poista valittu viestihistoria";

/* No comment provided by engineer. */
"Delete the account %@?" = "Poista tili %@?";

/* No comment provided by engineer. */
"Delete the layout \"%@\" from %@?" = "Poista asettelu \"%1$@\" kohteesta %2$@?";

/* No comment provided by engineer. */
"Delete the selection" = "Poista valinta";

/* No comment provided by engineer. */
"Delete the theme \"%@\" from %@?" = "Poista teema \"%1$@\" kohteesta %2$@?";

/* No comment provided by engineer. */
"Delete Theme" = "Poista teema";

/* No comment provided by engineer. */
"Delete Xtra?" = "Poista ekstra?";

/* No comment provided by engineer. */
"Deny" = "Kiellä";

/* No comment provided by engineer. */
"Destination" = "Kohde";

/* No comment provided by engineer. */
"Details" = "Yksityiskohdat";

/* No comment provided by engineer. */
"Disable chat encryption" = "Poista salaus käytöstä";

/* No comment provided by engineer. */
"Disabled" = "Poistettu käytöstä";

/* No comment provided by engineer. */
"Disabling automatic contact consolidation will also unconsolidate all existing metacontacts, including any created manually.  You will need to recreate any manually-created metacontacts if you proceed." = "Automaattisen älykkäiden yhteystietojen luomisen pysäyttäminen poistaa myös kaikki jo olemassa olevat älykkäät yhteystiedot, myös ne jotka olet luonut itse. Sinun täytää luoda ne uudestaan, mikäli jatkat.";

/* No comment provided by engineer. */
"Disassociate the selected contact from this meta contact. This does not remove the contact from your contact list." = "Poistaa valitun tiedon tästä älykkäästä yhteystidosta. Tämä ei poista tietoa ystävistäsi.";

/* Event: disconnected (follows a contact's name displayed as a header) */
"disconnected" = "kirjautui ulos";

/* No comment provided by engineer. */
"Disconnecting" = "Kirjaudutaan ulos";

/* Dismiss All Button */
"Dismiss All" = "Kuittaa kaikki";

/* No comment provided by engineer. */
"Display a Growl notification" = "Näytä Growl huomautus";

/* No comment provided by engineer. */
"Display a sticky Growl notification" = "Näytä pysyvä Growl huomautus";

/* No comment provided by engineer. */
"Display an alert" = "Näytä huomautus";

/* No comment provided by engineer. */
"Display Name" = "Näytä nimi";

/* No comment provided by engineer. */
"Display Name For:" = "Näytä nimi kohteelle:";

/* No comment provided by engineer. */
"Display name in the dock icon" = "Näytä nimi dock-kuvakkeessa";

/* No comment provided by engineer. */
"Display Preferences" = "Näyttöasetukset";

/* No comment provided by engineer. */
"Display the alert \"%@\"" = "Näytä huomautus \"%@\"";

/* No comment provided by engineer. */
"Do Not Disturb" = "Älä häiritse";

/* No comment provided by engineer. */
"Do not disturb" = "Älä häiritse";

/* No comment provided by engineer. */
"Do not use an icon to represent you." = "Älä käytä kuvaketta esittämään sinua";

/* No comment provided by engineer. */
"dock icon set" = "dock-kuvakepaketti";

/* AdiumXtras category name */
"Dock Icons" = "Dock-kuvakkeet";

/* No comment provided by engineer. */
"Don't ask again" = "Älä kysy uudelleen";

/* No comment provided by engineer. */
"Don't Send" = "Älä lähetä";

/* No comment provided by engineer. */
"Donate" = "Lahjoita";

/* 'done' button title */
"Done" = "Valmis";

/* No comment provided by engineer. */
"Edit" = "Muokkaa";

/* Edit In Address Book Contextual Menu */
"Edit In Address Book" = "Muokkaa Osoitekirjassa";

/* No comment provided by engineer. */
"Edit Layouts" = "Muokkaa asetteluja";

/* No comment provided by engineer. */
"Edit Link" = "Muokkaa linkkiä";

/* No comment provided by engineer. */
"Edit Presets" = "Muokkaa esiasetuksia";

/* No comment provided by engineer. */
"Edit Status Menu" = "Muokkaa tilavalikkoa";

/* No comment provided by engineer. */
"Edit Themes" = "Muokkaa teemoja";

/* No comment provided by engineer. */
"Email:" = "Sähköposti:";

/* No comment provided by engineer. */
"Emoticon" = "Hymiö";

/* No comment provided by engineer. */
"emoticon set" = "hymiöpaketti";

/* AdiumXtras category name */
"Emoticons" = "Hymiöt";

/* Emoticons in <an emoticon pack name> */
"Emoticons in %@" = "Hymiöt paketissa %@";

/* No comment provided by engineer. */
"Encrypt chats as requested" = "Salaa keskustelut pyyntöjen mukaan";

/* No comment provided by engineer. */
"Encrypt chats automatically" = "Salaa keskustelut automaattisesti";

/* No comment provided by engineer. */
"Encrypted by Off-the-Record Messaging" = "Salaa poistamalla kaikki viittaukset keskusteluihin";

/* No comment provided by engineer. */
"Encrypted Messaging" = "Salattu viestintä";

/* No comment provided by engineer. */
"Encrypted OTR chat initiated." = "Salattu keskustelu aloitettu";

/* No comment provided by engineer. */
"Encrypted OTR chat initiated. %@'s identity not verified." = "Salattu keskustelu aloitettu. Identiteettiä (%@) ei ole vahvistettu.";

/* No comment provided by engineer. */
"Encryption" = "Salaus";

/* No comment provided by engineer. */
"Encryption Settings" = "Salauksen asetukset";

/* Label besides the field for contact encryption settings */
"Encryption:" = "Salaus:";

/* No comment provided by engineer. */
"Ended encrypted OTR chat." = "Salattu keskustelu lopetettu.";

/* Enter key for sending messages */
"Enter" = "Enter";

/* No comment provided by engineer. */
"Enter a unique name for this new event set." = "Anna paketille nimi, joka ei ole käytössä.";

/* No comment provided by engineer. */
"Enter a unique name for this new layout." = "Anne asettelulle nimi, joka ei ole käytössä.";

/* No comment provided by engineer. */
"Enter a unique name for this new theme." = "Anna teemalle nimi, joka ei ole käytössä.";

/* Enter and return key for sending messages */
"Enter and Return" = "Enter ja return";

/* No comment provided by engineer. */
"Enter group name:" = "Anna ryhmän nimi:";

/* No comment provided by engineer. */
"Enter the contact's type and screen name/number:" = "Anna ystävän viestinimi/numero:";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* No comment provided by engineer. */
"Error occurs" = "Virhe tapahtuu";

/* No comment provided by engineer. */
"Error Saving Theme" = "Virhe tallennettaessa teemaa";

/* File transfer connecting status description */
"Establishing file transfer connection" = "Aloitetaan tiedoston siirtoa";

/* No comment provided by engineer. */
"Even if the contact already has a contact icon" = "Vaikka ystävä olisi asettanut itselleen oman kuvan";

/* No comment provided by engineer. */
"Event preset:" = "Ilmoitustyyli:";

/* Name of preferences and tab for specifying what Adium should do when events occur - for example, when display a Growl alert when John signs on. */
"Events" = "Tapahtumat";

/* No comment provided by engineer. */
"Every 10 Seconds" = "Joka 10:s sekuntti";

/* No comment provided by engineer. */
"Every 15 Seconds" = "Joka 15:a sekuntti";

/* No comment provided by engineer. */
"Every 30 Seconds" = "Joka 30:s sekuntti";

/* No comment provided by engineer. */
"Every 5 Seconds" = "Joka 5:s sekuntti";

/* No comment provided by engineer. */
"Every 60 Seconds" = "Joka minutti";

/* No comment provided by engineer. */
"Exactly" = "Tarkalleen";

/* No comment provided by engineer. */
"Extended Away" = "Laajennettu poissaolo";

/* No comment provided by engineer. */
"Extended away" = "Laajennettu poissaolo";

/* File transfer failed status description */
"Failed" = "Epäonnistunut";

/* No comment provided by engineer. */
"failed to receive %@" = "tiedoston %@ vastaanottaminen epäonnistui";

/* No comment provided by engineer. */
"failed to send you %@" = "sinulle ei voitu lähettää tiedostoa %@";

/* No comment provided by engineer. */
"Far Left" = "Vasen laita";

/* No comment provided by engineer. */
"Far Right" = "Oikea laita";

/* No comment provided by engineer. */
"File" = "Arkisto";

/* No comment provided by engineer. */
"File is checksummed before sending" = "Ennen lähettämistä tiedoston eheys tarkistetaan.";

/* No comment provided by engineer. */
"File Transfer" = "Tiedostojen siirtäminen";

/* No comment provided by engineer. */
"File transfer begins" = "Tiedoston siirto alkaa";

/* No comment provided by engineer. */
"File transfer cancelled by the other side" = "Toinen osapuoli peruuttaa tiedoston siirron";

/* No comment provided by engineer. */
"File transfer completed successfully" = "Tiedoston siirto suoritetaan onnistuneesti";

/* No comment provided by engineer. */
"File transfer failed" = "Tiedoston siirto epäonnistui";

/* No comment provided by engineer. */
"File transfer fails" = "Tiedoston siirto epäonnistuu";

/* No comment provided by engineer. */
"File transfer requested" = "Yritetään siirtää tiedostoa";

/* No comment provided by engineer. */
"File Transfers" = "Tiedostojen siirrot";

/* No comment provided by engineer. */
"Fill" = "Täytä";

/* No comment provided by engineer. */
"Filter logs by date" = "Suodata viestihistoriat päiväyksen mukaan";

/* No comment provided by engineer. */
"Find" = "Etsi";

/* No comment provided by engineer. */
"Find Next" = "Etsi seuraava";

/* No comment provided by engineer. */
"Find Previous" = "Etsi edellinen";

/* Fingerprint for <name>: */
"Fingerprint for %@:" = "Sormenjälki ystävälle %@:";

/* No comment provided by engineer. */
"Fingerprint for you (%@): %@\n\nPurported fingerprint for %@: %@\n\nIs this the verifiably correct fingerprint for %@?" = "Oma sormenjälkesi (%1$@): %2$@\n\nToisen osapuolen sormenjälki %3$@: %4$@\n\nOvatko ylläoleva tieto vahvistettu oikeiksi henkilölle %5$@?";

/* No comment provided by engineer. */
"Fingerprint Help" = "Sormenjälkien ohje";

/* No comment provided by engineer. */
"Fingerprint: %.80s" = "Sormenjälki: %.80s";

/* No comment provided by engineer. */
"Finished" = "Valmis";

/* Address Book Name display style, e.g. Evan */
"First" = "Etunimi";

/* Address Book Name display style, e.g. Evan Schoenberg */
"First Last" = "Etunimi Sukunimi";

/* Address Book Name display style, e.g. Evan Dreskin */
"First Middle" = "Etunimi Toinen nimi";

/* Address Book Name display style, e.g. Evan Dreskin Schoenberg */
"First Middle Last" = "Etunimi Toinen nimi Sukunimi";

/* No comment provided by engineer. */
"First Name:" = "Ensimmäinen nimi:";

/* No comment provided by engineer. */
"Flash names with unviewed messages" = "Väläytä ystäviä, joiden viestejä et ole lukenut";

/* No comment provided by engineer. */
"For some older log formats, the importer cannot properly determine which account was used for conversation.  In such cases, the importer will guess which account to use based upon the order of the accounts.  Before importing Fire's logs, arrange your account order within the Preferences." = "Joidenkin vanhempien viestihistoriamuotojen kohdalla keskusteluun käytettyä tiliä ei voida selvittää. Näissä tapauksissa tilit määritellään niiden keskinäisen järjestyksen perusteella. Ennen kun tuot viestihistoriat Firestä järjestä ne haluamaasi keskinäiseen järjestykseen.";

/* No comment provided by engineer. */
"Force encryption and refuse plaintext" = "Pakota salaukseen ja hylkää salaamaton teksti";

/* Button title to make Adium no longer know a user's encryption fingerprint */
"Forget Fingerprint" = "Unohda sormenjälki";

/* No comment provided by engineer. */
"Format" = "Muotoile";

/* Format name as: [popup menu of choices like 'First, Last'] */
"Format name as:" = "Näytä nimet muodossa:";

/* No comment provided by engineer. */
"Free for chat" = "Vapaa keskusteluun";

/* No comment provided by engineer. */
"From" = "Keneltä";

/* Label in front of the dropdown of accounts from which to send a message */
"From:" = "Keneltä:";

/* General preferences label */
"General" = "Yleiset";

/* No comment provided by engineer. */
"Generating private encryption key for %@" = "Luodaan yksityistä salausavainta ystävälle  %@";

/* Insert Current iTunes track genre toolbar menu item. */
"Genre" = "Laji";

/* No comment provided by engineer. */
"Get Info" = "Näytä tiedot";

/* No comment provided by engineer. */
"Get Info for Contact" = "Näytä ystävän tiedot";

/* 'go back' button title */
"Go Back" = "Takaisin";

/* No comment provided by engineer. */
"Goes away" = "Poistuu";

/* No comment provided by engineer. */
"Group" = "Ryhmä";

/* No comment provided by engineer. */
"Group Bubbles" = "Ryhmäkuplat";

/* No comment provided by engineer. */
"Group Chat" = "Ryhmäkeskustelu";

/* The popup button after this lists status types; it will determine the status type with which a status group will be listed in status menus */
"Group with:" = "Ryhmittele:";

/* Growl installation window title */
"Growl Installation Recommended" = "Growlin asennusta suositellaan";

/* Growl update window title */
"Growl Update Available" = "Growlin päivitys saatavilla";

/* No comment provided by engineer. */
"Help" = "Ohjeet";

/* No comment provided by engineer. */
"Hide Adium" = "Kätke Adium";

/* No comment provided by engineer. */
"Hide Emoticons" = "Kätke hymiöt";

/* No comment provided by engineer. */
"Hide Fonts" = "Kätke fontit";

/* No comment provided by engineer. */
"Hide Others" = "Kätke muut";

/* No comment provided by engineer. */
"Hide the status window when Adium is not active" = "Piilota tilaikkuna kun Adium ei ole aktiivinen";

/* No comment provided by engineer. */
"Hide Toolbar" = "Kätke työkalupalkki";

/* Translation Error */
"Host not found" = "Palvelinta ei löydy";

/* singular hour */
"hour" = "tunti";

/* plural hours */
"hours" = "tuntia";

/* No comment provided by engineer. */
"Hours" = "Tuntia";

/* Adium forums page. Localized only if a translated version exists. */
"http://forum.adiumx.com/" = "http://forum.adiumx.com/";

/* Adium homepage. Only localize if a translated version of the page exists. */
"http://www.adiumx.com/" = "http://www.adiumx.com/";

/* Adium xtras page. Localized only if a translated version exists. */
"http://www.adiumxtras.com/" = "http://www.adiumxtras.com/";

/* No comment provided by engineer. */
"I speak:" = "Sanon:";

/* No comment provided by engineer. */
"Icon" = "Kuvake";

/* No comment provided by engineer. */
"Idle" = "Ei aktiivinen";

/* No comment provided by engineer. */
"Idle Time" = "Aika ei aktiivisena";

/* No comment provided by engineer. */
"If multiple accounts can send to this contact or this is a combined contact, change the source and/or destination of this chat" = "Jos useat tunnukset voivat lähettää viestejä tälle ystävälle tai jos tämä on älykäs yhteystieto, valitse lähde/kohde tälle keskustelulle";

/* Ignore means no longer receive messages from this contact in a chat */
"Ignore" = "Älä huomioi";

/* No comment provided by engineer. */
"Image Picker" = "Oma kuva";

/* No comment provided by engineer. */
"Images" = "Kuvat";

/* No comment provided by engineer. */
"Import" = "Tuo";

/* No comment provided by engineer. */
"Import Fire Logs?" = "Tuo Firen viestihistoriat";

/* No comment provided by engineer. */
"Import Fire's Settings" = "Tuo Firen asetukset";

/* No comment provided by engineer. */
"Import my contacts' names from the Address Book" = "Hae ystävien nimet Osoitekirjasta";

/* No comment provided by engineer. */
"In Group" = "Ryhmässä";

/* No comment provided by engineer. */
"In Group:" = "Ryhmässä:";

/* No comment provided by engineer. */
"Incoming:" = "Saapuva:";

/* No comment provided by engineer. */
"Incorrect number of command argments." = "Virheellinen komennon argumenttien määrä.";

/* No comment provided by engineer. */
"Indexing %i of %i" = "Indeksoidaan %1$i / %2$i";

/* No comment provided by engineer. */
"Individual Contact" = "Yksittäinen ystävä";

/* short form of tab view item title for Contact Info window's first tab */
"Info" = "Tiedot";

/* No comment provided by engineer. */
"Initializing transfer" = "Aloitetaan siirtoa";

/* No comment provided by engineer. */
"Initiate Encrypted OTR Chat" = "Aloita salattu keskustelu";

/* No comment provided by engineer. */
"Initiating file transfer" = "Aloitetaan tiedoston siirto";

/* No comment provided by engineer. */
"Insert" = "Lisää";

/* No comment provided by engineer. */
"Insert %@ Link" = "Lisää %@ linkki";

/* No comment provided by engineer. */
"Insert a script" = "Lisää skripti";

/* No comment provided by engineer. */
"Insert an emoticon into the text" = "Lisää tekstiin hymiö";

/* Label for iTunes toolbar menu item. */
"Insert current iTunes track information." = "Lisää iTunesin kappaleen tiedot.";

/* No comment provided by engineer. */
"Insert Emoticon" = "Lisää hymiö";

/* Label used for edit and contextual menus of iTunes triggers */
"Insert iTunes Token" = "Lisää iTunesin tieto";

/* No comment provided by engineer. */
"Insert Link" = "Lisää linkki";

/* No comment provided by engineer. */
"Insert link to active page in %@" = "Lisää linkki aktiiviseen sivuun selaimessa %@";

/* No comment provided by engineer. */
"Insert Script" = "Lisää tieto";

/* Title of installation failed window */
"Installation Failed" = "Asennus epäonnistui";

/* Installation introduction, like 'Installation of the message style Fiat was successful...'. */
"Installation of the %@ %@ was successful because the file was already in the correct location." = "Kohteen:  %1$@ %2$@ on jo asennettu.";

/* Installation sentence, like 'Installation of the message style Fiat was successful.'. */
"Installation of the %@ %@ was successful." = "Kohteen: %1$@ %2$@ asennus onnistui.";

/* Installation failed sentence, like 'Installation of the message style Fiat was unsuccessful.'. */
"Installation of the %@ %@ was unsuccessful." = "Kohteen %1$@ %2$@ asennus epäonnistui.";

/* Title of installation successful window */
"Installation Successful" = "Asennus onnistui";

/* No comment provided by engineer. */
"Invisible" = "Näkyminen Offline-tilassa";

/* No comment provided by engineer. */
"Invite to Chat" = "Kutsu keskusteluun";

/* Event: is no longer seen (follows a contact's name displayed as a header) */
"is no longer seen" = "ei ole enää tavoitettavissa";

/* No comment provided by engineer. */
"Is no longer seen" = "Ei ole enää tavoitettavissa";

/* No comment provided by engineer. */
"Is seen" = "On tavoitettavissa";

/* Event: is seen (follows a contact's name displayed as a header) */
"is seen" = "on tavoitettavissa";

/* No comment provided by engineer. */
"Is sent a message" = "On lähettänyt viestin";

/* No comment provided by engineer. */
"Italic" = "Kursivoi";

/* Label for iTunes toolbar menu item. */
"iTunes" = "iTunes";

/* Insert Current iTunes track store link toolbar menu item. */
"iTunes Music Store Link" = "iTunes Store -linkki";

/* No comment provided by engineer. */
"Join Group Chat" = "Liity ryhmäkeskusteluun";

/* Contact joined Chat Name */
"joined %@" = "liitytty keskusteluun %@";

/* No comment provided by engineer. */
"Joins a group chat" = "Liittyy ryhmäkeskusteluun";

/* No comment provided by engineer. */
"Jump to Selection" = "Hyppää valintaan";

/* Contact list labels */
"Labels" = "Tekstit";

/* Address Book Name display style, e.g. Schoenberg Evan */
"Last First" = "Sukunimi Etunimi";

/* Address Book Name display style, e.g. Schoenberg Evan Dreskin */
"Last First Middle" = "Sukunimi Etunimi Toinen nimi";

/* No comment provided by engineer. */
"Last Name:" = "Sukunimi:";

/* A time interval such as '4 days ago' will be shown after this tooltip identifier */
"Last Seen" = "Nähty viimeeksi";

/* Address Book Name display style, e.g. Schoenberg, Evan */
"Last, First" = "Sukunimi, Etunimi";

/* Address Book Name display style, e.g. Schoenberg, Evan Dreskin */
"Last, First Middle" = "Sukunimi, Etunimi Toinen nimi";

/* No comment provided by engineer. */
"Launch Disk Utility" = "Avaa Levytyökalu";

/* No comment provided by engineer. */
"Leaves a group chat" = "Poistuu ryhmäkeskustelusta";

/* No comment provided by engineer. */
"Left" = "Poistui";

/* Contact left Chat Name */
"left %@" = "poistui keskustelusta %@";

/* No comment provided by engineer. */
"License" = "Lisenssi";

/* No comment provided by engineer. */
"Link" = "Linkki";

/* Label for the text entry area for the name when creating a link */
"Link Text:" = "Linkin teksti:";

/* No comment provided by engineer. */
"Listed on the following of your accounts:" = "Seuraavissa tileissä:";

/* No comment provided by engineer. */
"Loading" = "Ladataan";

/* No comment provided by engineer. */
"Maximum Width:" = "Suurin leveys:";

/* Speak Text action keyword: message */
"Message" = "Viesti";

/* No comment provided by engineer. */
"Message History" = "Viestihistoria";

/* No comment provided by engineer. */
"Message received" = "Viesti vastaanotettu";

/* No comment provided by engineer. */
"Message received (Background chat)" = "Viesti vastaanotettu taustalla";

/* No comment provided by engineer. */
"Message received (Initial)" = "Keskustelun ensimmäinen viesti vastaanotettu";

/* No comment provided by engineer. */
"Message sent" = "Viesti lähetetty";

/* No comment provided by engineer. */
"message style" = "keskustelutyyli";

/* AdiumXtras category name */
"Message Styles" = "Keskustelutyylit";

/* No comment provided by engineer. */
"Message:" = "Viesti:";

/* No comment provided by engineer. */
"Messages" = "Keskustelut";

/* Short string used to identify the 'service' of a multiple-service meta contact */
"Meta" = "Meta";

/* No comment provided by engineer. */
"Minimize" = "Pienennä";

/* singular minute */
"minute" = "minuutti";

/* plural minutes */
"minutes" = "minuuttia";

/* No comment provided by engineer. */
"Mobile" = "Matkapuhelin";

/* singular month */
"month" = "kuukausi";

/* plural months */
"months" = "kuukautta";

/* Prompt when more than one web browser is available when inserting a link from the active browser. */
"Multiple browsers are open. Please select one link:" = "Useita selaimia on avoinna, valitse mistä haluat ottaa linkin:";

/* No comment provided by engineer. */
"Multiple Packs Selected" = "Useita paketteja valittu";

/* No comment provided by engineer. */
"My Webcam" = "Oma webkamerani";

/* Insert Current iTunes track name toolbar menu item. */
"Name" = "Nimi";

/* No comment provided by engineer. */
"Names" = "Nimet";

/* No comment provided by engineer. */
"Never" = "Älä piilota";

/* No comment provided by engineer. */
"New Chat" = "Uusi keskustelu";

/* No comment provided by engineer. */
"New email notification" = "Uuden sähköpostin huomautus";

/* No comment provided by engineer. */
"New Event Set" = "Uusi tapahtumapaketti";

/* No comment provided by engineer. */
"New Group" = "Uusi ryhmä";

/* No comment provided by engineer. */
"New Message" = "Uusi viesti";

/* No comment provided by engineer. */
"New Person" = "Uusi ystävä";

/* Next Button */
"Next" = "Seuraava";

/* No comment provided by engineer. */
"Next Chat" = "Seuraava keskustelu";

/* No comment provided by engineer. */
"Nickname:" = "Lempinimi:";

/* No comment provided by engineer. */
"No" = "Ei";

/* Message to show in the Encryption OTR preferences when an account is selected which does not have a private key */
"No private key present" = "Tunnuksella ei ole omaa sormenjälkeä";

/* Translation Error */
"No translated page was returned" = "Käännöstä ei voitu palauttaa";

/* Translation Error */
"No translation found: Server too busy" = "Käännöstä ei löytynyt; Palvelin on liian kiireinen";

/* No comment provided by engineer. */
"None" = "Ei mitään";

/* No comment provided by engineer. */
"Nontrusted Xtra" = "Epäluotettava Ekstra";

/* No comment provided by engineer. */
"Normal" = "Normaali";

/* No comment provided by engineer. */
"Normally" = "Normaalisti";

/* No comment provided by engineer. */
"Not at Home" = "Ei kotona";

/* No comment provided by engineer. */
"Not at home" = "Ei kotona";

/* No comment provided by engineer. */
"Not at my desk" = "Ei paikalla";

/* No comment provided by engineer. */
"Not at my Desk" = "Ei paikalla";

/* No comment provided by engineer. */
"Not Available" = "Ei tavoitettavissa";

/* No comment provided by engineer. */
"Not available" = "Ei tavoitettavissa";

/* No comment provided by engineer. */
"Not in the office" = "Ei toimistolla";

/* No comment provided by engineer. */
"Not in the Office" = "Ei toimistolla";

/* No comment provided by engineer. */
"Not private" = "Ei yksityinen";

/* Short identifier for the 'notes' which can be entered for contacts. This will be shown in the contact list tooltips. */
"Notes" = "Muuta";

/* Label beside the field for contact notes in the Settings tab of the Get Info window */
"Notes:" = "Muuta:";

/* No comment provided by engineer. */
"Occupied" = "Varattu";

/* Name of offline group */
"Offline" = "Offline";

/* No comment provided by engineer. */
"Offline Contacts" = "Offline ystävät";

/* No comment provided by engineer. */
"OK" = "Ok";

/* No comment provided by engineer. */
"On Account" = "Tilissä";

/* No comment provided by engineer. */
"On Accounts:" = "Tileissä:";

/* Advanced contact list: hide the contact list: On screen edges */
"On screen edges" = "Näytön laidoilla";

/* No comment provided by engineer. */
"On the phone" = "Puhelimessa";

/* No comment provided by engineer. */
"On the Phone" = "Puhelimessa";

/* No comment provided by engineer. */
"On vacation" = "Lomalla";

/* No comment provided by engineer. */
"On Vacation" = "Lomalla";

/* No comment provided by engineer. */
"Once" = "Kerran";

/* Explanation of metacontact creation */
"Once combined, Adium will treat these contacts as a single individual both on your contact list and when sending messages.\n\nYou may un-combine these contacts by getting info on the combined contact." = "Yhdistämisen jälkeen, Adium käsittelee näytä yhteystietoja yksittäisenä ystävänä.\n\nVoit halutessasi perua yhdistämisen ystävän tiedoista.";

/* No comment provided by engineer. */
"Online" = "Online";

/* A time interval such as '3 days' will be shown after this identifier */
"Online For" = "Ollut online";

/* This tooltip identifier will followed by a date */
"Online Since" = "Online lähtien";

/* FT Preferences */
"only from contacts on my Contact List" = "ainoastaan ystäviltä";

/* No comment provided by engineer. */
"Open" = "Avaa";

/* FT Preferences */
"Open \"Safe\" files after receiving" = "Avaa \"Turvalliset\" tiedostot latauksen valmistuttua";

/* No comment provided by engineer. */
"Open a message window" = "Avaa keskusteluikkuna";

/* No comment provided by engineer. */
"Open Appearance Prefs" = "Avaa ulkoasuasetukset";

/* No comment provided by engineer. */
"Open Event Prefs" = "Avaa tapahtuma-asetukset";

/* No comment provided by engineer. */
"Open Message Prefs" = "Avaa keskusteluasetukset";

/* No comment provided by engineer. */
"Open Preferences" = "Avaa asetukset";

/* No comment provided by engineer. */
"Opening logs" = "Avaa viestihistoria";

/* No comment provided by engineer. */
"Options" = "Valinnat";

/* No comment provided by engineer. */
"Other" = "Muu";

/* No comment provided by engineer. */
"Other Unavailable" = "Muu tavoittamattomissa";

/* No comment provided by engineer. */
"OTR Fingerprint" = "Sormenjälki";

/* No comment provided by engineer. */
"OTR Fingerprint Verification" = "Sormenjäljen vahvistus";

/* No comment provided by engineer. */
"Out to lunch" = "Syömässä";

/* No comment provided by engineer. */
"Outgoing:" = "Lähtevä:";

/* No comment provided by engineer. */
"Overwrite Address Book images with contacts' icons" = "Tallenna ystävien kuvat osoitekirjaan";

/* No comment provided by engineer. */
"Page Setup" = "Sivun asetukset";

/* Label for the password field in the account preferences */
"Password:" = "Salasana:";

/* No comment provided by engineer. */
"Paste" = "Liitä";

/* No comment provided by engineer. */
"Paste and Match Style" = "Liitä ja sovita tyyliin";

/* No comment provided by engineer. */
"Paste Style" = "Liitä tyyli";

/* No comment provided by engineer. */
"Paste with Images and Colors" = "Liitä kuvilla ja väreillä";

/* Personal preferences label */
"Personal" = "Oma profiili";

/* No comment provided by engineer. */
"Play a sound" = "Toista ääni";

/* No comment provided by engineer. */
"Play the sound \"%@\"" = "Toista ääni: \"%@\"";

/* No comment provided by engineer. */
"Please wait" = "Odota";

/* No comment provided by engineer. */
"Preferences" = "Asetukset";

/* waiting to begin a file transfer status */
"Preparing file" = "Valmistellaan tiedostoa";

/* File transfer preparing status description */
"Preparing file transfer" = "Valmistellaan tiedoston siirtoa";

/* No comment provided by engineer. */
"Previous Chat" = "Edellinen keskustelu";

/* No comment provided by engineer. */
"Print" = "Tulosta";

/* No comment provided by engineer. */
"Privacy" = "Yksityisyys";

/* No comment provided by engineer. */
"Privacy level:" = "Yksityisyyden taso:";

/* No comment provided by engineer. */
"Privacy Settings" = "Yksityisyyden asetukset";

/* No comment provided by engineer. */
"Private" = "Yksityinen";

/* No comment provided by engineer. */
"Private connection closed" = "Yksityinen yhteys suljettu";

/* No comment provided by engineer. */
"Profile (if available):" = "Profiili (jos saatavilla):";

/* No comment provided by engineer. */
"Profile to display when contacts request information about you (not supported by all services). Text may be formatted using the Edit and Format menus." = "Profiili joka näytetään kun ystävät katsovat sinun tietojasi. Kaikki palvelut eivät tue tätä ominaisuutta. Tekstiä voi muotoilla Muokkaa ja Muotoile valikoiden kautta.";

/* FT Preferences */
"Progress:" = "Edistyminen:";

/* No comment provided by engineer. */
"Proxy" = "Välityspalvelin";

/* No comment provided by engineer. */
"Quit" = "Lopeta";

/* No comment provided by engineer. */
"Quit Adium" = "Lopeta Adium";

/* No comment provided by engineer. */
"Rank" = "Sijoitus";

/* No comment provided by engineer. */
"received %@" = "vastaanotettiin %@";

/* No comment provided by engineer. */
"received new email" = "uusi sähköposti vastaanotettiin";

/* FT Preferences */
"Receiving files:" = "Tiedostojen vastaanottaminen:";

/* No comment provided by engineer. */
"Regular Window" = "Normaali ikkuna";

/* File transfer cancelled remotely status description */
"Remote contact cancelled" = "Toinen osapuoli peruutti";

/* No comment provided by engineer. */
"Remove" = "Poista";

/* No comment provided by engineer. */
"Remove Contact" = "Poista ystävä";

/* No comment provided by engineer. */
"Remove from List" = "Poista listasta";

/* No comment provided by engineer. */
"Remove from list?" = "Poista listasta?";

/* No comment provided by engineer. */
"Remove Link" = "Poista linkki";

/* No comment provided by engineer. */
"Rename Group" = "Uudelleennimeä ryhmä";

/* No comment provided by engineer. */
"Reorder emoticon packs by dragging. Packs are used in the order listed." = "Järjestä hymiöpaketit uudelleen vetämällä. Paketteja käytetään listatussa järjestyksessä.";

/* No comment provided by engineer. */
"Repeatedly" = "Toistuvasti";

/* No comment provided by engineer. */
"Report a Bug" = "Ilmoita ongelmasta (Vain englanniksi)";

/* Event: requested authorization (follows a contact's name displayed as a header) */
"requested authorization" = "pyytää lupaa nähdä sinut";

/* No comment provided by engineer. */
"Requests authorization" = "Pyytää lupaa nähdä sinut";

/* No comment provided by engineer. */
"requests to send you %@" = "haluaa lähettää sinulle tiedoston %@";

/* No comment provided by engineer. */
"Restore Default Formatting" = "Palauta vakiomuotoilu";

/* Return key for sending messages */
"Return" = "Enter";

/* No comment provided by engineer. */
"Returns from away" = "Palaa takaisin";

/* No comment provided by engineer. */
"Returns from idle" = "On taas aktiivinen";

/* No comment provided by engineer. */
"Right" = "Oikea";

/* No comment provided by engineer. */
"Right to Left" = "Oikealta vasemmalle";

/* No comment provided by engineer. */
"Run an Applescript" = "Suorita Applescript";

/* %@ will be replaced by the name of the applescript to run. */
"Run the Applescript \"%@\"" = "Suorita Applescript \"%@\"";

/* No comment provided by engineer. */
"Sample" = "Näyte";

/* No comment provided by engineer. */
"Save As" = "Tallenna nimellä";

/* FT Preferences */
"Save files to:" = "Tallenna kansioon:";

/* AdiumXtras category name */
"Scripts" = "Scriptit";

/* No comment provided by engineer. */
"Search" = "Etsi";

/* Placeholder for searching logs by date */
"Search by Date" = "Etsi päiväys";

/* Placeholder for searching logs by content */
"Search Content" = "Etsi sisältöä";

/* No comment provided by engineer. */
"Search for '%@' complete." = "Kohteen \"%@\" haku suoritettu.";

/* Placeholder for searching logs from an account */
"Search From" = "Etsi tunnusta";

/* No comment provided by engineer. */
"Search In Address Book" = "Etsi Osoitekirjasta";

/* No comment provided by engineer. */
"Search Menu" = "Etsi-valikko";

/* No comment provided by engineer. */
"Search or filter logs" = "Etsi tai suodata viestihistoriaa";

/* iTunes toolbar menu item title to search selection in iTMS. */
"Search Selection in Music Store" = "Etsi valintaan iTunes Storesta";

/* Placeholder for searching logs with/to a contact */
"Search To" = "Etsi vastaanottajaa";

/* No comment provided by engineer. */
"Searching for '%@'" = "Etsitään kohdetta '%@'";

/* singular second */
"second" = "sekunti";

/* plural seconds */
"seconds" = "sekuntia";

/* No comment provided by engineer. */
"Secure ID for this session:" = "Tämän keskustelun turvallinen ID:";

/* No comment provided by engineer. */
"Select All" = "Valitse kaikki";

/* No comment provided by engineer. */
"Select an Applescript" = "Valitse Applescript";

/* No comment provided by engineer. */
"Select an entry from your address book, or add a new person." = "Valitse kortti Osoitekirjasta tai lisää uusi tieto.";

/* No comment provided by engineer. */
"Select Buddy" = "Valitse ystävä";

/* No comment provided by engineer. */
"Send %@ the message \"%@\"" = "Lähetä ystävälle %1$@ viesti \"%2$@\"";

/* No comment provided by engineer. */
"Send a file" = "Lähetä tiedosto";

/* No comment provided by engineer. */
"Send a message" = "Lähetä viesti";

/* No comment provided by engineer. */
"Send Feedback" = "Lähetä palautetta (Vain englanniksi)";

/* No comment provided by engineer. */
"Send File" = "Lähetä tiedosto";

/* No comment provided by engineer. */
"Send File to %@" = "Lähetä tiedosto ystävälle %@";

/* No comment provided by engineer. */
"Send Later" = "Lähetä myöhemmin";

/* Send Later dialogue explanation text */
"Send Later will send the message the next time both you and %@ are online. Send Now may work if %@ is invisible or is not on your contact list and so only appears to be offline." = "\"Lähetä myöhemmin\" lähettää viestin seuraavan kerran, kun sekä sinä että \"%1$@\" olette online-tilassa. \"Lähetä nyt\" saattaa toimia, jos \"%2$@\" on näkymättömässä tilassa tai näyttää olevan offline-tilassa, koska ei ole ystäväluettelossasi.";

/* No comment provided by engineer. */
"Send Now" = "Lähetä nyt";

/* No comment provided by engineer. */
"Sends a message" = "Lähettää viestin";

/* No comment provided by engineer. */
"Sends a message in a background chat" = "Lähettää viestin taustalla olevassa keskustelussa";

/* No comment provided by engineer. */
"Sends an initial message" = "Aloittaa uuden keskustelun";

/* No comment provided by engineer. */
"sent you %@" = "lähetti sinulle %@";

/* No comment provided by engineer. */
"service icons" = "palveluiden kuvakkeet";

/* AdiumXtras category name */
"Service Icons" = "Palveluiden Kuvakkeet";

/* No comment provided by engineer. */
"Service:" = "Palvelu:";

/* Services menu item in the Adium menu */
"Services" = "Palvelut";

/* tab view item title for Contact Settings (Settings) */
"Settings" = "Asetukset";

/* Shift key word + Directional arrow keys word */
"Shift + Arrows (%@ and %@)" = "Vaihto + Nuolet (%1$@ ja %2$@)";

/* No comment provided by engineer. */
"Show All" = "Näytä kaikki";

/* No comment provided by engineer. */
"Show Colors" = "Näytä värit";

/* No comment provided by engineer. */
"Show contact information tooltips" = "Näytä ystävien tiedot työkaluvihjeinä";

/* No comment provided by engineer. */
"Show Details" = "Näytä yksityiskohdat";

/* No comment provided by engineer. */
"Show Emoticons" = "Näytä hymiöt";

/* No comment provided by engineer. */
"Show Fonts" = "Näytä fontit";

/* No comment provided by engineer. */
"Show Group Online Count" = "Näytä ryhmissä olevien online-ystävien määrä";

/* No comment provided by engineer. */
"Show Group Total Count" = "Näytä ryhmäissä olevien ystävien määrä";

/* No comment provided by engineer. */
"Show Groups" = "Näytä ryhmät";

/* Show In Address Book Contextual Menu */
"Show In Address Book" = "Näytä Osoitekirjassa";

/* No comment provided by engineer. */
"Show in Finder" = "Näytä Finderissa";

/* No comment provided by engineer. */
"Show Info" = "Näytä tiedot";

/* Tooltip for the Show Info toolbar button */
"Show information about this contact or group and change settings specific to it" = "Näytä tietoa tästä ystävästä tai ryhmästä ja muuta sen asetuksia";

/* No comment provided by engineer. */
"Show Offline Contacts" = "Näytä offline-tilassa olevat ystävät";

/* No comment provided by engineer. */
"Show Offline Group" = "Näytä ryhmä offline-tilassa oleville";

/* No comment provided by engineer. */
"Show or hide emoticons in logs" = "Näytä tai kätke hymiöt viestihistoriassa";

/* No comment provided by engineer. */
"Show Status Messages" = "Näytä tilaviestit";

/* No comment provided by engineer. */
"Show the contact list window" = "Näytä ystävälista";

/* No comment provided by engineer. */
"Show the contact list window for %.1f seconds" = "Näytä ystävälista %.1f sekunnin ajan";

/* No comment provided by engineer. */
"Show the contact list:" = "Näytä ystäväluettelo:";

/* FT Preferences */
"Show the File Transfers window automatically" = "Näytä tiedostojen siirtoikkuna automaattisesti";

/* No comment provided by engineer. */
"Show the status window above other windows" = "Näytä tilaikkuna muiden ikkunoiden yläpuolella";

/* No comment provided by engineer. */
"Show this contact's icon" = "Näytä tämän ystävän kuvake";

/* No comment provided by engineer. */
"Show Toolbar" = "Näytä työkalupalkki";

/* Transitions in this context means the names fading in as the contact signs on and out as the contact signs off */
"Show transitions as contacts sign on and off" = "Näytä siirtymät ystävien tilan vaihtuessa";

/* No comment provided by engineer. */
"Show User Icons" = "Näytä ystävien kuvat";

/* No comment provided by engineer. */
"Show window shadow" = "Näytä ikkunan varjo";

/* No comment provided by engineer. */
"Show/Hide Emoticons" = "Näytä/Kätke hymiöt";

/* No comment provided by engineer. */
"Show/Hide the Contacts Drawer" = "Näytä/Kätke ystävät-vetolaatikko";

/* No comment provided by engineer. */
"Signing off" = "Kirjautuu ulos";

/* No comment provided by engineer. */
"Signs off" = "Kirjautuu ulos";

/* No comment provided by engineer. */
"Signs on" = "Kirjautuu sisään";

/* No comment provided by engineer. */
"Since Yesterday" = "Eilisen jälkeen";

/* button title for skipping the import of another client in the setup wizard */
"Skip Import" = "Ohita tuominen";

/* No comment provided by engineer. */
"Sort Contacts" = "Lajittele ystävät";

/* No comment provided by engineer. */
"Sort Contacts Alphabetically" = "Lajittele ystävät aakkosellisesti";

/* No comment provided by engineer. */
"Sort contacts by last name" = "Lajittele ystävät sukunimen mukaan";

/* No comment provided by engineer. */
"Sort Contacts by Status" = "Lajittele ystävät tilan mukaan";

/* No comment provided by engineer. */
"Sort Contacts Manually" = "Lajittele ystävät käsin";

/* No comment provided by engineer. */
"Sort groups alphabetically" = "Lajittele ryhmät aakkosellisesti";

/* No comment provided by engineer. */
"sound set" = "äänivalikoima";

/* No comment provided by engineer. */
"Sound set:" = "Äänivalikoima:";

/* AdiumXtras category name */
"Sound Sets" = "Äänivalikoimat";

/* No comment provided by engineer. */
"Sound:" = "Ääni:";

/* No comment provided by engineer. */
"Source/Destination" = "Lähde/Kohde";

/* short phrase for the contact alert which speaks the event */
"Speak Event" = "Puhu tapahtuma";

/* No comment provided by engineer. */
"Speak Event Time" = "Puhu tapahtuman aika";

/* No comment provided by engineer. */
"Speak Name" = "Puhu nimi";

/* No comment provided by engineer. */
"Speak Specific Text" = "Puhu valittu teksti";

/* short phrase for the contact alert which speaks the event */
"Speak the event aloud" = "Puhu tapahtuma ääneen";

/* No comment provided by engineer. */
"Speak the text \"%@\"" = "Puhu teksti \"%@\"";

/* No comment provided by engineer. */
"Speech" = "Puhe";

/* No comment provided by engineer. */
"Spelling" = "Oikeinkirjoitus";

/* No comment provided by engineer. */
"SQL Log Viewer" = "SQL Lokin katselija";

/* No comment provided by engineer. */
"SQLite Log Viewer" = "SQLite Lokin katselija";

/* file transfer is stalled status message */
"Stalled" = "Keskeytynyt";

/* No comment provided by engineer. */
"Start Speaking" = "Aloita puhuminen";

/* No comment provided by engineer. */
"Status" = "Tila";

/* No comment provided by engineer. */
"Status Group Deletion Confirmation" = "Tilaryhmän poistamisen varmistaminen";

/* No comment provided by engineer. */
"status icons" = "tilakuvakkeet";

/* AdiumXtras category name */
"Status Icons" = "Tilakuvakkeet";

/* No comment provided by engineer. */
"Stepped out" = "poistui";

/* No comment provided by engineer. */
"Stepped Out" = "Poistui";

/* Growl contact alert label */
"Sticky" = "Sticky";

/* No comment provided by engineer. */
"Stop Speaking" = "Lopeta puhuminen";

/* No comment provided by engineer. */
"Stopped" = "Pysähtynyt";

/* No comment provided by engineer. */
"Stretch to fill" = "Venytä täyttämään";

/* Title above the box in the Speak Text action's detail pane. The box contains keywords such as \%a and what they will become when spoken such as User Alias. */
"Substitutions:" = "Korvaukset:";

/* Title of a panel shown after adding successfully adding a contact to the address book. */
"Success" = "Onnistuminen";

/* No comment provided by engineer. */
"Successfully received %@" = "Onnistuneesti vastaanotettu:  %@";

/* No comment provided by engineer. */
"Successfully sent %@" = "Onnistuneesti lähetetty: %@";

/* Translation Error */
"Support for this language has not been installed on your Macintosh" = "Tämän kielen tukea ei ole asennettu tietokoneellesi";

/* No comment provided by engineer. */
"Systemwide HTTP Settings" = "Järjestelmän HTTP-asetukset";

/* No comment provided by engineer. */
"Systemwide SOCKS4 Settings" = "Järjestelmän SOCKS4-asetukset";

/* No comment provided by engineer. */
"Systemwide SOCKS5 Settings" = "Järjestelmän SOCKS-asetukset";

/* No comment provided by engineer. */
"Tabs" = "Välilehdet";

/* No comment provided by engineer. */
"Text To Speak:" = "Puhuttava teksti:";

/* No comment provided by engineer. */
"The characters you're entering are not valid for an account name on this service." = "Merkit joita olet käyttänyt nimessä eivät ole sallittuja tässä palvelussa.";

/* No comment provided by engineer. */
"The contact %@ wants to add %@ to his or her contact list for the following reason:\n%@" = "Henkilö %1$@ haluaa lisätä henkilön %2$@ hänen ystävälistaansa seuraavasta syystä:\n%3$@";

/* No comment provided by engineer. */
"The contact %@ wants to add %@ to his or her contact list." = "Henkilö %1$@ haluaa lisätä henkilön %2$@ ystävälistaansa.";

/* No comment provided by engineer. */
"The conversation with %@ timed out." = "Aikavirhe keskustelussa henkilön %@ kanssa.";

/* No comment provided by engineer. */
"The following message was <b>not encrypted</b>: " = "Seuraavaa viestiä <b>ei salattu</b>: ";

/* No comment provided by engineer. */
"The selected Xtra will be moved to the Trash." = "Valittu Ekstra siirretään Roskakoriin.";

/* No comment provided by engineer. */
"The selected Xtras will be moved to the Trash." = "Valitut Ekstrat siirretään Roskakoriin.";

/* No comment provided by engineer. */
"The transfer of %@ failed" = "Tiedoston %@ siirto epäonnistui";

/* No comment provided by engineer. */
"This Month" = "Tämä kuukausi";

/* No comment provided by engineer. */
"This Week" = "Tämä viikko";

/* No comment provided by engineer. */
"This will remove %@ from the contact lists of your online accounts." = "Tämä poistaa ystävän %@ kaikkien online-tilassa olevien tiliesi ystävälistoilta.";

/* No comment provided by engineer. */
"This will remove %i contacts from the contact lists of your online accounts." = "Tämä poistaa %i ystävää kaikkien online-tilassa olevien tiliesi ystävälistoilta. ";

/* No comment provided by engineer. */
"This will remove %i items from the contact lists of your online accounts. Contacts in any deleted groups will also be removed.\n\nThis action can not be undone." = "Tämä poistaa %i kohdetta online-tilassa olevien tiliesi ystävälistoilta. Ystävät mistä tahansa poistetusta ryhmästä poistuvat myös.\n\nToimintoa ei voida peruuttaa.";

/* No comment provided by engineer. */
"This will remove the group \"%@\" from the contact lists of your online accounts. The %i contacts within this group will also be removed.\n\nThis action can not be undone." = "Tämä poistaa ryhmän \"%1$@\" online-tilassa olevien tiliesi ystävälistoista. Tässä ryhmässä olevat %2$i ystävää tullaan myös poistamaan.\n\nToimintoa ei voida peruuttaa.";

/* No comment provided by engineer. */
"This Xtra is not hosted by adiumxtras.com. Automatic installation is not allowed." = "Tämä Ekstra ei ole peräisin osoitteesta adiumxtras.com. Automaattista asennusta ei voida käyttää.";

/* No comment provided by engineer. */
"Tile" = "Pala";

/* Speak Text action keyword: time */
"Time" = "Aika";

/* No comment provided by engineer. */
"Title:" = "Otsikko:";

/* No comment provided by engineer. */
"To" = "Kenelle";

/* Label in front of the dropdown for picking which contact to send a message to in the message window */
"To:" = "Kenelle:";

/* No comment provided by engineer. */
"Today" = "Tänään";

/* No comment provided by engineer. */
"Toggle display of groups" = "Näytä ystävät ryhmissä";

/* No comment provided by engineer. */
"Toggle display of offline contacts" = "Näytä offline-ystävät";

/* No comment provided by engineer. */
"Toggle encrypted messaging. Shows a closed lock when secure and an open lock when insecure." = "Vaihda salauksen tilaa. Keskustelujen ollessa salattu, lukko on kiinni ja lukon ollessa avoinna keskusteluja ei salata.";

/* No comment provided by engineer. */
"Toggle Groups Display" = "Näytä ystävät ryhmissä";

/* No comment provided by engineer. */
"Toggle Offline Contacts" = "Näytä offline-ystävät";

/* No comment provided by engineer. */
"Tooltips" = "Työkaluvihjeet";

/* Submenu for iTunes toolbar item menu for inserting current track information. */
"Track Information" = "Kappaleen tiedot";

/* No comment provided by engineer. */
"Transcripts" = "Siirrot";

/* Parameters are <error msg>,<original msg> */
"Translation Error: %@\nOriginal Message: \"%@\"" = "Käännösvirhe: %1$@\nAlkuperäinen viesti: \"%2$@\"";

/* No comment provided by engineer. */
"Translation Options" = "Käännöksen asetukset";

/* No comment provided by engineer. */
"Try running Repair Permissions from Disk Utility." = "Yritä korjata levyn oikeuden käyttäen Levytyökalua.";

/* Un-ignore means begin receiving messages from this contact again in a chat */
"Un-ignore" = "Pura esto";

/* Translation Error */
"Unable to encode message for transmission to translation server" = "Virhe muotoillessa viestiä käännöspalvelimelle lähettämistä varten";

/* No comment provided by engineer. */
"Unable to send message to %@." = "Viestiä ystävälle %@ ei voida lähettää.";

/* No comment provided by engineer. */
"Unable to write file %@ to %@" = "Tiedostoa %1$@ ei voida tallentaa kohteeseen %2$@";

/* No comment provided by engineer. */
"Unable to write log" = "Viestihistoriaa ei voida tallentaa";

/* No comment provided by engineer. */
"Unavailable" = "Ei tavoitettavissa";

/* Unblock Contact menu item */
"Unblock" = "Lopeta estäminen";

/* No comment provided by engineer. */
"Unconsolidate all metacontacts" = "Pura kaikki älykkäät yhteystiedot";

/* No comment provided by engineer. */
"Underline" = "Alleviivaa";

/* No comment provided by engineer. */
"Unknown conversation error." = "Tuntematon keskustelun virhe.";

/* Translation Error */
"Unknown error in translation" = "Tuntematon käännöksen virhe";

/* No comment provided by engineer. */
"Unused" = "Ei köytössä";

/* No comment provided by engineer. */
"Unverified" = "Vahvistamaton";

/* No comment provided by engineer. */
"URL:" = "URL:";

/* No comment provided by engineer. */
"Use Address Book images as contacts' icons" = "Käytä Osoitekirjan kuvia ystävien kuvina";

/* No comment provided by engineer. */
"Use another account if necessary" = "Vaadittaessa käytä toista tunnusta ";

/* No comment provided by engineer. */
"Use custom pitch:" = "Käytä mukautettua äänenkorkeutta:";

/* No comment provided by engineer. */
"Use custom rate:" = "Käytä mukautettua puhenopeutta:";

/* Radio button in the Personal tab of Account preferences.  This -must- be a short string of 20 characters or less. */
"Use global icon" = "Käytä kuvaketta";

/* No comment provided by engineer. */
"Use middle name if available" = "Näytä toinen nimi jos mahdollista";

/* No comment provided by engineer. */
"Use nickname if available" = "Näytä lempinimi jos mahdollista";

/* No comment provided by engineer. */
"Use Selection for Find" = "Etsi valinnalla";

/* No comment provided by engineer. */
"Use System Default" = "Käytä järjestelmän oletusta";

/* No comment provided by engineer. */
"Use the icon below to represent you." = "Käytä alla olevaa kuvaketta esittämään sinua";

/* Radio button in the Personal tab of Account preferences; an image is shown beneath it to select the account's icon.  This -must- be a short string of 20 characters or less. */
"Use this icon:" = "Käytä tätä:";

/* Speak Text action keyword: user alias */
"User alias" = "Käyttäjän viestinimi";

/* Speak Text action keyword: user name */
"User name" = "Käyttäjänimi";

/* No comment provided by engineer. */
"User Name" = "Käyttäjän nimi";

/* No comment provided by engineer. */
"User Name (Alias)" = "Käyttäjänimi (Viestinimi)";

/* Sample name and server for new IRC accounts */
"username@irc.server.com" = "kauttajanimi@irc.palvelin.fi";

/* No comment provided by engineer. */
"Using:" = "Käyttäen:";

/* No comment provided by engineer. */
"Verify" = "Vahvista";

/* No comment provided by engineer. */
"Verify Later" = "Vahvista myöhemmin";

/* No comment provided by engineer. */
"View" = "Näytä";

/* No comment provided by engineer. */
"View Chat Transcripts" = "Näytä viestihistoria";

/* No comment provided by engineer. */
"View previous conversations with this contact or chat" = "Näytä edellistä keskustelua tältä ystävältä tai tästä keskustelusta";

/* No comment provided by engineer. */
"Visual Notifications" = "Äänetön";

/* File transfer waiting on remote user status description */
"Waiting for transfer to be accepted" = "Odotetaan että siirto hyväksytään";

/* waiting to begin a file transfer status */
"Waiting to start." = "Odotetaan aloitusta.";

/* No comment provided by engineer. */
"Warning Level" = "Varoitusten taso";

/* singular week */
"week" = "viikko";

/* plural weeks */
"weeks" = "viikkoa";

/* No comment provided by engineer. */
"Welcome to Adium!" = "Tervetuloa Adiumiin!";

/* Event: went away (follows a contact's name displayed as a header) */
"went away" = "poistui";

/* Event: went idle (follows a contact's name displayed as a header) */
"went idle" = "siirtyi ei aktiiviseksi";

/* No comment provided by engineer. */
"When %@ connects" = "Kun %@ kirjautuu sisään";

/* No comment provided by engineer. */
"When %@ disconnects" = "Kun %@ kirjautuu ulos";

/* No comment provided by engineer. */
"When %@ goes away" = "Kun %@ poistuu";

/* No comment provided by engineer. */
"When %@ goes idle" = "Kun %@ ei ole enää aktiivinen";

/* No comment provided by engineer. */
"When %@ joins a group chat" = "Kun %@ liittyy ryhmäkeskusteluun";

/* No comment provided by engineer. */
"When %@ leaves a group chat" = "Kun %@ poistuu ryhmäkeskustelusta";

/* No comment provided by engineer. */
"When %@ requests authorization" = "Kun %@ pyytää lupaa keskustella kanssasi";

/* No comment provided by engineer. */
"When %@ returns from away" = "Kun %@ palaa takaisin";

/* No comment provided by engineer. */
"When %@ returns from idle" = "Kun %@ on jälleen aktiivinen";

/* No comment provided by engineer. */
"When %@ sends a message to you" = "Kun %@ lähettää sinulle viestin";

/* No comment provided by engineer. */
"When %@ sends a message to you in a background chat" = "Kun %@ lähettää viestin taustalla olevaan keskusteluun";

/* No comment provided by engineer. */
"When %@ sends an initial message to you" = "Kun %@ aloittaa keskustelun";

/* No comment provided by engineer. */
"When a contact joins a group chat" = "Kun ystävä liittyy ryhmäkeskusteluun";

/* No comment provided by engineer. */
"When a contact leaves a group chat" = "Kun ystävä poistuu ryhmäkeskustelusta";

/* No comment provided by engineer. */
"When a contact requests authorization" = "Kun henkilö pyytää lupaa keskustella kanssasi";

/* No comment provided by engineer. */
"When a file is checksummed prior to sending" = "Kun tiedoston ehjyys tarkistetaan ennen lähettämistä";

/* No comment provided by engineer. */
"When a file transfer begins" = "Kun tiedoston siirto alkaa";

/* No comment provided by engineer. */
"When a file transfer fails" = "Kun tiedoston siirto epäonnistuu";

/* No comment provided by engineer. */
"When a file transfer is cancelled remotely" = "Kun ystävä peruuttaa tiedoston siirron";

/* No comment provided by engineer. */
"When a file transfer is completed successfully" = "Kun tiedoston siirto on onnistuneesti suoritettu";

/* No comment provided by engineer. */
"When a file transfer is requested" = "Kun tiedosto halutaan siirtää";

/* No comment provided by engineer. */
"When a file transfer with %@ fails" = "Kun tiedoston siirto henkilön %@ kanssa epäonnistuu";

/* No comment provided by engineer. */
"When an error occurs" = "Kun tapahtuu virhe";

/* No comment provided by engineer. */
"When talking to %@" = "Kun keskustellaan henkilön %@ kanssa";

/* No comment provided by engineer. */
"When you connect" = "Kun kirjaudut sisään";

/* No comment provided by engineer. */
"When you disconnect" = "Kun kirjaudut ulos";

/* No comment provided by engineer. */
"When you no longer see %@" = "Kun %@ on tavoittamattomissa";

/* No comment provided by engineer. */
"When you receive a message in a background chat" = "Kun saat viestin taustalla olevassa keskustelussa";

/* No comment provided by engineer. */
"When you receive a new email notification" = "Kun saat uuden sähköpostin huomautuksen";

/* No comment provided by engineer. */
"When you receive an initial message" = "Kun ystävä aloittaa keskustelun kanssasi";

/* No comment provided by engineer. */
"When you receive any message" = "Kun saat viestin";

/* No comment provided by engineer. */
"When you see %@" = "Kun näet henkilön %@";

/* No comment provided by engineer. */
"When you send %@ a message" = "Kun lähetät henkilölle %@ viestin";

/* No comment provided by engineer. */
"When you send a message" = "Kun lähetät viestin";

/* Checkbox to indicate that something should occur while Adium is not the active application */
"While Adium is in the background" = "Kun Adium ei ole aktiivinen";

/* No comment provided by engineer. */
"Width:" = "Leveys:";

/* No comment provided by engineer. */
"Window" = "Ikkuna";

/* No comment provided by engineer. */
"Window Handling" = "Ikkunan asetukset";

/* No comment provided by engineer. */
"Within Last 2 Months" = "Viimeisen kahden kuukauden sisällä";

/* No comment provided by engineer. */
"Within Last 2 Weeks" = "Viimeisen kahden viikon sisällä";

/* No comment provided by engineer. */
"Writing Direction" = "Kirjoituksen suunta";

/* No comment provided by engineer. */
"Xtra Download" = "Ekstran latauas";

/* No comment provided by engineer. */
"Xtra Downloading Error" = "Virhe ladattaessa Ekstraa";

/* No comment provided by engineer. */
"Xtras Manager" = "Ekstrojen hallinta";

/* singular year */
"year" = "vuosi";

/* plural years */
"years" = "vuotta";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"You are editing a default event set.  Please enter a unique name for your modified set." = "Muokkaa vakiohuomautuksia. Anna uniikki nimi nyt muokkaamallesi valikoimalle.";

/* No comment provided by engineer. */
"You connect" = "Kirjaudut sisään";

/* No comment provided by engineer. */
"You disconnect" = "Kirjaudut ulos";

/* No comment provided by engineer. */
"You have file transfers in progress.\nAre you sure you want to quit?" = "Tiedoston siirtoja on meneillään.\nOletko varma että haluat lopettaa?";

/* No comment provided by engineer. */
"You have unread messages.\nAre you sure you want to quit?" = "Sinulla on lukemattomia viestejä.\nOletko varma että haluat lopettaa?";

/* You said Message to Contact */
"You said %@ to %@" = "Sanoit %1$@ henkilölle %2$@";

/* You sent a message to Contact */
"You sent a message to %@" = "Lähetit viestin henkilölle %@";

/* Message when sending encrypted messages to a contact expecting unencrypted ones. %s will be a name. */
"You sent an encrypted message, but %@ was not expecting encryption." = "Lähetit salatun viestin, mutta henkilö %@ ei odottanut salausta.";

/* Message when sending unencrypted messages to a contact expecting encrypted ones. %s will be a name. */
"You sent an unencrypted message, but %@ was expecting encryption." = "Lähetit salaamattoman viestin, mutta henkilö %@ odotti salausta.";

/* No comment provided by engineer. */
"Your message was not sent. You should end the encrypted chat on your side or re-request encryption." = "Viestiäsi ei lähetetty. Sinun tulisi sulkea salaus tai pyytää toista osapuolta salaamaan uudestaan keskustelu.";

/* No comment provided by engineer. */
"Your name, which on supported services will be sent to remote contacts. Substitutions from the Edit->Scripts and Edit->iTunes menus may be used here." = "Sinun nimesi, joka näytetään ystävillesi kaikissa tätä tukevissa palveluissa. iTunes-valikon tietoja voidaan käyttää tässä nimessä.";

/* First placeholder is a name; second is a filename */
"Your transfer to %@ of %@ failed" = "Tiedoston %2$@ siirto henkilölle  %1$@ epäonnistui";

/* no file size */
"Zero bytes" = "Nolla tavua";
